[
  {
    "id": 213804,
    "name": "[School's Actually Fun]",
    "flavor_text": "[Character Skin]<br>I hate studying and teachers all be a bunch of losers, but I never knew school could be so fun. I can recruit as many henchmen as I need to do me bidding. Oh yeah, life's good.",
    "icon": 213804,
    "character_id": 2138,
    "style_illust_id": 213804,
    "dot_id": 213804
  },
  {
    "id": 220306,
    "name": "At the Victory Banquet",
    "flavor_text": "[Character Skin]<br>The threat of the Seven Heroes is no more. My duty, the duty of generations of Holy Emperors, has come to an end. Finally, the wishes of Emperor Leon and those who came later can be put to rest. This evening's banquet is dedicated to our history and the emperors who led us here. Let us enjoy one last moment together.",
    "icon": 220306,
    "character_id": 2203,
    "style_illust_id": 220306,
    "dot_id": 220306
  },
  {
    "id": 220405,
    "name": "At the Victory Celebration",
    "flavor_text": "[Character Skin]<br>I have put an end to the ambitions of the Seven Heroes for the good of all who dwell in the Empire of Varennes. My duty to carry on the wishes of the emperors is at an end. I wish now for a new purpose.",
    "icon": 220405,
    "character_id": 2204,
    "style_illust_id": 220405,
    "dot_id": 220405
  },
  {
    "id": 223214,
    "name": "[Waiting Under a Full Moon]",
    "flavor_text": "[Character Skin]<br>Some say the full moon brings fulfillment. Others say it sends you into a whirlwind of emotions. On this night, I wear this for you. Will my wishes and longings come to fruition under the full moon? Or...",
    "icon": 223214,
    "character_id": 2232,
    "style_illust_id": 223214,
    "dot_id": 223200
  },
  {
    "id": 229305,
    "name": "[Cool You Down]",
    "flavor_text": "[Character Skin]<br>Doesn't it feel great to cool down? So, let's make it real chilly! If my charisma doesn't set your heart ablaze, you can just freeze, bones and all!",
    "icon": 229305,
    "character_id": 2293,
    "style_illust_id": 229305,
    "dot_id": 229305
  },
  {
    "id": 229308,
    "name": "[Stationmaster Rocbouquet]",
    "flavor_text": "[Character Skin]<br>Day in, day out, you all do an amazing job keeping things running safely. Drivers, conductors, station attendants, not to mention our passengers... Always remember: safety first! Wondering why you're seeing a new face today? I'm the stationmaster for the day, of course!",
    "icon": 229308,
    "character_id": 2293,
    "style_illust_id": 229308,
    "dot_id": 229300
  },
  {
    "id": 229310,
    "name": "[Boba]",
    "flavor_text": "[Character Skin]<br>What are these little black things? Do you just eat them? Oh I see! You sip 'em up through this straw! No wonder the straw's so wide. Interesting... *slurp* Yum! So tasty!",
    "icon": 229310,
    "character_id": 2293,
    "style_illust_id": 229310,
    "dot_id": 229300
  },
  {
    "id": 230606,
    "name": "[Let Me Go Alone]",
    "flavor_text": "[Character Skin]<br>Knowing Sarah, I'd rather go in by myself, so I don't get distracted by all that girl talk from her and the others. But don't worry about me. I'm good at this. If any weirdos try to sneak a peek, I'll turn this place into a bloodbath.",
    "icon": 230606,
    "character_id": 2306,
    "style_illust_id": 230606,
    "dot_id": 230606
  },
  {
    "id": 230705,
    "name": "[Monika's Resolve]",
    "flavor_text": "[Character Skin]<br>I remember it like it was yesterday...<br>standing before the crowd in this dress.<br>My brother meant to choose the man I would marry. But I had already decided in my heart who the only man for me could be.",
    "icon": 230705,
    "character_id": 2307,
    "style_illust_id": 230705,
    "dot_id": 230704
  },
  {
    "id": 230707,
    "name": "[Band Leader]",
    "flavor_text": "[Character Skin]<br>It's my job to hold the band together. If I get a note wrong, everyone goes off beat. It can be a little nerve-wracking, but music should always be fun. So, what do you say we have some fun!",
    "icon": 230707,
    "character_id": 2307,
    "style_illust_id": 230707,
    "dot_id": 230707
  },
  {
    "id": 230804,
    "name": "[The Importance of Long Hair]",
    "flavor_text": "[Character Skin]<br>Long hair is required of a lady of nobility. Until I cut it myself, I didn't think it to be anything special. But I was wrong. The length symbolizes a readiness to shoulder the burden of longstanding noble traditions.",
    "icon": 230804,
    "character_id": 2308,
    "style_illust_id": 230804,
    "dot_id": 230804
  },
  {
    "id": 230805,
    "name": "[It's An Escort Mission Uniform]",
    "flavor_text": "[Character Skin]<br>I have been charged with protecting Lady Monika as she attends her awards ceremony. This uniform is, of course, for that mission. She demanded it be a little showy... so my outfit's a little...extravagant.",
    "icon": 230805,
    "character_id": 2308,
    "style_illust_id": 230805,
    "dot_id": 230805
  },
  {
    "id": 310106,
    "name": "[The Blue of Sea and Sky]",
    "flavor_text": "[Character Skin]<br>Is it so strange for a mage to pause by the shore? Even my heart has been imbued with the azure blue of the sea and the sky. It is here that I am most at peace. ",
    "icon": 310106,
    "character_id": 3101,
    "style_illust_id": 310106,
    "dot_id": 310106
  },
  {
    "id": 310406,
    "name": "[The Hero's Dilemma]",
    "flavor_text": "[Character Skin]<br>I got a large bowl of the famous Champon noodles as a thank me for my service. This is the best! But the only way to eat it is to unmorph, so do I just grab and run? That's not very hero-like! Ahh, what to do?!",
    "icon": 310406,
    "character_id": 3104,
    "style_illust_id": 310406,
    "dot_id": 310406
  },
  {
    "id": 310605,
    "name": "[Lingering Doubt]",
    "flavor_text": "[Character Skin]<br>Even before I accepted the demon blood, I was lost. Will I grow up? Will I change? I faced that person, and things ended up this way, but I still can't figure it out. Have I grown up?",
    "icon": 310605,
    "character_id": 3106,
    "style_illust_id": 310605,
    "dot_id": 310605
  },
  {
    "id": 312305,
    "name": "[The Red of Sea and Sky]",
    "flavor_text": "[Character Skin]<br>I came here not to scream at the sunset, but rather to watch as the powerful setting sun dyes both the sea and the sky a beautiful red. I cannot even fathom how poets can compare this scene to the end of a life.",
    "icon": 312305,
    "character_id": 3123,
    "style_illust_id": 312305,
    "dot_id": 312305
  },
  {
    "id": 313103,
    "name": "[I Don't Want Candy]",
    "flavor_text": "[Character Skin]<br>This is not some costume. This is my true form, and the only thing I want is your life. Don't worry, I'll leave you with just a little bit of energy, just enough so you don't perish.",
    "icon": 313103,
    "character_id": 3131,
    "style_illust_id": 313103,
    "dot_id": 313103
  },
  {
    "id": 313306,
    "name": "[I'm the Pumpkin Princess]",
    "flavor_text": "[Character Skin]<br>Pumpkin Princess here! A pumpkin is much too heavy to wear as a hat, but I think I've done my best to match the motif. I wonder what he would say if he saw this outfit?",
    "icon": 313306,
    "character_id": 3133,
    "style_illust_id": 313306,
    "dot_id": 313306
  },
  {
    "id": 313703,
    "name": "[Water Mystic's Halloween]",
    "flavor_text": "[Character Skin]<br>This paper talisman allows me to move freely on land. I just get around by hopping! My body gives off a curious scent, and the human stench doesn't bother me anymore. This costume is great, too. I love Halloween!",
    "icon": 313703,
    "character_id": 3137,
    "style_illust_id": 313703,
    "dot_id": 313703
  },
  {
    "id": 320106,
    "name": "[Cheers to a New Year]",
    "flavor_text": "[Character Skin]<br>We've survived another year. War, monsters, disaster... Somehow or another, we've made our way through many daily hardships, so let us rejoice! Such is the reward a survivor receives. All the best in the new year!",
    "icon": 320106,
    "character_id": 3201,
    "style_illust_id": 320106,
    "dot_id": 320106
  },
  {
    "id": 320404,
    "name": "[It's Steampunk!]",
    "flavor_text": "[Character Skin]<br>It's not a Quell; it's a machine! And not just any machine... It's something called a steam engine. Who needs magic? Gimme a steam hammer, and I'll smash that Egg to bits!",
    "icon": 320404,
    "character_id": 3204,
    "style_illust_id": 320404,
    "dot_id": 320404
  },
  {
    "id": 610105,
    "name": "[This Is My Dream]",
    "flavor_text": "[Character Skin]<br>I tried to emulate Elysed's fashion sense. I hope I can be as amazing as she is one day. And also marry a man as amazing as my brother.",
    "icon": 610105,
    "character_id": 6101,
    "style_illust_id": 610105,
    "dot_id": 610100
  },
  {
    "id": 610107,
    "name": "[Let's Be Kids Again!]",
    "flavor_text": "[Character Skin]<br>I know I said I'd aid House Julanius, but today has been so much fun I just wanna forget it all! Kids can have as much ice cream and watermelon as they want. I wanna be a kid forever!",
    "icon": 610107,
    "character_id": 6101,
    "style_illust_id": 610107,
    "dot_id": 610107
  },
  {
    "id": 611203,
    "name": "[I'm Not Stingy]",
    "flavor_text": "[Character Skin]<br>I'm not stingy when it comes time to show off my figure. If you want a look, go for it. No big deal. But in exchange, you WILL hear what I have to say. Naturally, nothing in this world is free.",
    "icon": 611203,
    "character_id": 6112,
    "style_illust_id": 611203,
    "dot_id": 611203
  },
  {
    "id": 711103,
    "name": "[Don't Just Up and Talk to Me]",
    "flavor_text": "[Character Skin]<br>Do you think every girl relaxing on the beach is waiting to be talked to? Don't judge a book by its cover. Right now, I'm brooding over my relationship with my parents. That's it! I've had it with you creeping up on me grinning like that! Crimson Flare!",
    "icon": 711103,
    "character_id": 7111,
    "style_illust_id": 711103,
    "dot_id": 711103
  },
  {
    "id": 1000110201,
    "name": "[Mooncakes Are Better]",
    "flavor_text": "[Character Skin]<br>I heard that the moon tonight is the most beautiful of the year. You know how they say bread is better than the songs of birds? For me, mooncakes are better than the moon itself. Anyways, this mooncake is the best ever!",
    "icon": 1000110201,
    "character_id": 1102,
    "style_illust_id": 1000110201,
    "dot_id": 1000110201
  },
  {
    "id": 1000220502,
    "name": "[Halloween Automaton]",
    "flavor_text": "[Character Skin]<br>So, what do you think? Isn't this a great costume? I dressed up as a Halloween automaton! What do you mean I've always been an automaton? Okay, I don't have time for this. Where's my candy?",
    "icon": 1000220502,
    "character_id": 2205,
    "style_illust_id": 1000220502,
    "dot_id": 220502
  },
  {
    "id": 1000224401,
    "name": "[If I Weren't Azami]",
    "flavor_text": "[Character Skin]<br>If I were not a ninja, what happiness would be awaiting me? But if I weren't, I would no longer be Azami. Happiness or Azami... Which is more important to me?",
    "icon": 1000224401,
    "character_id": 2244,
    "style_illust_id": 1000224401,
    "dot_id": 224400
  },
  {
    "id": 1000310502,
    "name": "[Like a Different World]",
    "flavor_text": "[Character Skin]<br>To work as a dancer... I thought it would be in a club. Who knew I'd be able to enjoy the freedom of dancing out here in broad daylight? It's definitely more fun to dance here.",
    "icon": 1000310502,
    "character_id": 3105,
    "style_illust_id": 1000310502,
    "dot_id": 1000310502
  },
  {
    "id": 1000313101,
    "name": "[April Hare]",
    "flavor_text": "[Character Skin]<br>So many things start to go haywire in the spring, like the hare who collects eggs. Why does it gather eggs? Does it want to eat them or hatch them? Either way, there's nothing weird about me dressing up as a hare collecting eggs. That's because eggs are my favorite.",
    "icon": 1000313101,
    "character_id": 3131,
    "style_illust_id": 1000313101,
    "dot_id": 313100
  },
  {
    "id": 1000710201,
    "name": "[Christmas Liz]",
    "flavor_text": "[Character Skin]<br>Merry Christmas! I'm Santa, and Polka here is Rudolph the Red-Nosed Reindeer. Ring-a-ling-a ding-dong-ding! The sleigh bells are jingling! Time to go deliver some presents!",
    "icon": 1000710201,
    "character_id": 7102,
    "style_illust_id": 1000710201,
    "dot_id": 710200
  },
  {
    "id": 1000710501,
    "name": "[Faerie Trickster!]",
    "flavor_text": "[Character Skin]<br>Heheh, a faerie's pranks are no joke. Time to set off a mountain of fireworks to celebrate the new year and scare the living daylights out of that punk, Polka.",
    "icon": 1000710501,
    "character_id": 7105,
    "style_illust_id": 1000710501,
    "dot_id": 710500
  },
  {
    "id": 1000711101,
    "name": "[Santa and Reindeer in One]",
    "flavor_text": "[Character Skin]<br>I am Santa and reindeer two in one! That's very me, don't you think? I've picked out a gift for you, so just be grateful and thank me properly!",
    "icon": 1000711101,
    "character_id": 7111,
    "style_illust_id": 1000711101,
    "dot_id": 1000711101
  }
]