[
  {
    "id": 10101,
    "banner_id": 10010101,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Ep. 1 Polka Lynn Wood, Acrobat",
    "text": "Polka's little sister Liz was abducted by a demon, so he decided to join the Grave Knights to find leads. He had to pass a test, which consisted of conquering a tower, also known as a Grave, alongside Otherworld Warriors. He reached the top floor and released Black, one such warrior. Having passed the test and become a Grave Knight, Polka was given a mission by Zenon, the Marquis of Loanne."
  },
  {
    "id": 10102,
    "banner_id": 10010201,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Ep. 2 The Astronomer Shen Du",
    "text": "Polka's first mission was to rescue Shen Du, an astronomer captured by Don Scaccini. With the help of Faerie, Valdor, and a new group of Otherworld Warriors, they successfully broke Shen Du out and fought off demonic beasts controlled by Scaccini."
  },
  {
    "id": 10103,
    "banner_id": 10010301,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Ep. 3 The Bat King of Podorui",
    "text": "Polka and company visited the castle of Podorui in their quest to find Ren Dahao, Chief Astronomer and Shen Du's master. Meanwhile, Scaccini had placed a bounty on Polka's group, and assassins were after them. Pursued by the assassins and beasts, they entered the castle and were granted an audience with its lord, Count Leonid. When Polka looked inside the Holy Grail, it showed Liz, his captured sister."
  },
  {
    "id": 10104,
    "banner_id": 10010401,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Ep. 4 Tu Kwai, Queen of Dae",
    "text": "In order to rescue his sister Liz, Polka, together with Valdor and the Otherworld Warriors, headed east for the country of Dae. They met Dorte, a girl who was being chased by Daean soldiers. They tried to make it through without fighting the soldiers, only to be caught by the Daean ruler, Tu Kwai. But Terry acted as a decoy, allowing them to escape. Dorte then guided Polka and the others to the witch's cave."
  },
  {
    "id": 10105,
    "banner_id": 10010501,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Ep. 5 The Wicked Witch of the East",
    "text": "Polka's group reached the witch's cave. They made their way inside while struggling with traps set by the witch and her daughters. Eventually, Terry gave his life so they could get through the worst of them. After accepting the reality of Terry's sacrifice, they reached the innermost part of the cave to confront the Wicked Witch."
  },
  {
    "id": 10106,
    "banner_id": 10010601,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Ep. 6 Madeleine, Warrior of Gessiah: Part 1",
    "text": "Having driven back the witch, Polka's group was unable to rescue Liz. His next mission was to ask the people of Gessiah hiding in the Ache Woods for aid. When they arrived at the ruins where the Gessian people lived, Sif and the warrioress Madeleine ended up crossing blades.\n\nWatching all this unfold was Barthelemy, a clown who had subjugated Kzinssie, one of the Seven Heroes."
  },
  {
    "id": 10107,
    "banner_id": 10010701,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Ep. 7 Madeleine, Warrior of Gessiah: Part 2",
    "text": "The group proceeded into the ruins, but little did they know, the ruins had been turned into a Demon Tower. They reached the tower's summit with Barthelemy the assassin close behind. By releasing the demonic beast of the tower and making Kzinssie fight it, they managed to shake off Barthelemy and escape the ruins. Then, Polka and Madeleine promised to help each other."
  },
  {
    "id": 10108,
    "banner_id": 10010801,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Ep. 8 Barthelemy the Clown: Part 1",
    "text": "Polka's next mission was to retrieve Liz. He set out with the help of the Otherworld Warriors, but they stumbled into an illusory cave created by Barthelemy. Inside, Polka's group had to battle Kzinssie of the Seven Heroes. With the power Sophia inherited from past emperors, they emerged victorious."
  },
  {
    "id": 10109,
    "banner_id": 10010901,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Ep. 9 Barthelemy the Clown: Part 2",
    "text": "Upon defeating Kzinssie, Polka and company found themselves in front of a circus tent, another of Barthelemy's illusions. They made for the tent, fighting off beasts as they went. When they reached it, they found Barthelemy waiting for them. They defeated him, escaped his illusions, and made their way toward the witch's cave. However, the Barthelemy they defeated was yet another illusion."
  },
  {
    "id": 10110,
    "banner_id": 10011001,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Ep. 10 Liz Lynn Wood, Acrobat",
    "text": "The group joined up with Karman's unit, who had been working separately, and proceeded through the witch's cave. While fighting the witch's daughters, Faerie used powerful magic to counter their spells at the cost of being turned to stone. They finally arrived at the deepest reaches of the cave, defeated the Wicked Witch of the East, and reunited with Liz at last. They escaped together and returned to Vanguard."
  },
  {
    "id": 10111,
    "banner_id": 10011101,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Ep. 11 Brownie the Faerie",
    "text": "Polka's party headed to Faerie's Hidden Hamlet to find a way to restore them from petrification. They reached the Hamlet with the help of Edward the Lobster. But even after being given the medicine, they wouldn't respond. It was when Polka and company called Faerie by the name Brownie that they finally awakened."
  },
  {
    "id": 10112,
    "banner_id": 10011201,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Ep. 12 Evelyn & The Land of Beginnings",
    "text": "On Mikhail's orders, Polka's group made their way to investigate Sinon Village. There, they met Evelyn the witch, and together they fought demons of the Abyss. After the battle, Evelyn told them of the world's regeneration.\n\nMeanwhile, Mikhail and the others were searching for the dolphin figurine to activate Vanguard. But Karman, who was in collusion with Messina, stole it and activated Vanguard himself."
  },
  {
    "id": 10113,
    "banner_id": 10019001,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Gaiden 1 Zenon Ausbach",
    "text": "Zenon was captured by the Messina Empire. However, this was part of his plan to get to Dahao's hideout. Zenon, along with a group led by Shen Du who had infiltrated the castle, searched the sewers. They learned of the assassin Barthelemy's past through visions Dahao left behind. They finally reached the hideout, only to be met with Daean soldiers who had snuck in."
  },
  {
    "id": 10114,
    "banner_id": 10011301,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Ep. 13 Ren Dahao: Part 1",
    "text": "Polka's party stopped at Rashkuta while on their way east toward the country of Dae to rescue Zenon. They were staying the night when Barthelemy ambushed them. Barthelemy fell to Polka, but with his last breath, he showed memories of his past that revealed he was Polka's father.\n\nMeanwhile, Mikhail's party visited the shrine of Sarah's memories to rescue her."
  },
  {
    "id": 10115,
    "banner_id": 10011401,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Ep. 14 Ren Dahao: Part 2",
    "text": "Polka's party reached Huang and began their rescue of Zenon. They infiltrated the castle through a well, yet Tu Kwai was expecting them. Tu Kwai and Daean soldiers melted and merged into Dae's Colossus, which was a hard fight for the party until the disguised Ren Dahao revealed herself and helped defeat the Colossus.\nMikhail's crew lifted Sarah's curse and recovered memories of the Young Boy, the other Child of Destiny."
  },
  {
    "id": 10116,
    "banner_id": 10011501,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Ep. 15 Children of Destiny",
    "text": "Sarah's group arrived at a dark space, where the Young Boy was held, to rescue him. However, it was a trap set by the Archfiend. Just as those with memories of Sarah were cut off from the world, the Dark Star blotted out the sun...\n\nMeanwhile, Polka's group freed Gwayne the Dragon from a Grave and were on their way to battle the Dragonlord Byunei."
  },
  {
    "id": 10117,
    "banner_id": 10019101,
    "part": 1,
    "chapter": 1,
    "talk": 0,
    "title": "Gaiden 2 Dorra & Byunei",
    "text": "Gwayne and Polka's party were fighting tooth and nail against Byunei, who had become even more powerful than she was 300 years ago. It was with the aid of Dorra the Dragon, freed from a Grave by Otherworld Warriors, that Byunei was slain. They then closed the Abyss Gate.\n\nBut as the battle drew to a close, a sinister miasma took possession of Liz's body, and she was pregnant."
  },
  {
    "id": 10201,
    "banner_id": 10020101,
    "part": 1,
    "chapter": 2,
    "talk": 0,
    "title": "Ep. 1 Josephine Lynn Wood",
    "text": "The Rise of Morastrum came, yet it reaped no lives. Dahao, who prophesied the calamity, and the New Eight Stars, who believed in the prophecy, were being hunted for inciting needless panic.\nFifteen years later, Josephine, the child Liz bore after the battle with Byunei, was growing into a talented mage who could wield powerful mixed magic. After learning that the Archfiend had appeared, Polka and company reunited and sprang to action."
  },
  {
    "id": 10202,
    "banner_id": 10020201,
    "part": 1,
    "chapter": 2,
    "talk": 0,
    "title": "Ep. 2 The New Generation",
    "text": "After reuniting with Zenon and the Otherworld Warriors on the Solitary Island in the Silent Sea, Polka's party went off to pick up Jo. They met up with Valdor, Brownie the Faerie, Evelyn, and eventually Jo, all while escaping a deadly black mist.\nMeanwhile, Dahao and Shen Du were trying to locate Karman and another young boy, who was creating the mist. Who was this young boy with such a wicked aura?"
  },
  {
    "id": 10203,
    "banner_id": 10020301,
    "part": 1,
    "chapter": 2,
    "talk": 0,
    "title": "Ep. 3 Soul Inheritance",
    "text": "Polka's crew returned to Vanguard with Jo in tow and found it in chaos, beset by Another Young Boy's black mist and Karman's trap of termites. The Otherworld Warriors and Jo fought hard and drove them back. The black mist cleared, and a momentary peace came to Vanguard.\n\nThe purpose of Another Young Boy, the master of the mist, was to make contact with the Young Boy, a Child of Destiny from 300 years ago."
  },
  {
    "id": 10204,
    "banner_id": 10020401,
    "part": 1,
    "chapter": 2,
    "talk": 0,
    "title": "Ep. 4 The Return of Shen Du",
    "text": "Following the attack on Vanguard, the Young Boy had vanished. Thomas's group went to look for Sarah, who went after the Young Boy. Jo followed, hoping for a good fight.\nThe Young Boy, led by the voice of Another Young Boy, went to a Grave and opened the doors at its summit.\nMeanwhile, Shen Du reached Vanguard alone and told Zenon of the memories he inherited from Dahao."
  },
  {
    "id": 10205,
    "banner_id": 10020501,
    "part": 1,
    "chapter": 2,
    "talk": 0,
    "title": "Ep. 5 Corrupted Beast, Shucho's Grace",
    "text": "Jo, Polka, and the others made for the World Tower by submarine. While fighting demonic beasts, Liz defended Jo at the cost of her life but was later revived by a secret Shucho Art. Then, the Young Boy approached Jo and the others atop a corrupted holy beast. Karman had wiped the boy's memories of all but despair.\n\nAt this time, Messina's imperial fleet, as well as their beasts, surrounded Vanguard."
  },
  {
    "id": 10206,
    "banner_id": 10020601,
    "part": 1,
    "chapter": 2,
    "talk": 0,
    "title": "Ep. 6 Imperial Fleet & Igomahl the Harlequin",
    "text": "In Vanguard, Zenon and the Otherworld Warriors enacted a plan to confront the Empire. Jo's party, kept away from the World Tower by the Corrupted Beast, returned to Vanguard and attacked the Empire's fleet. The imperial fleet retreated.\n\nAt that time, Another Young Boy told the Young Boy his goal to recreate the world, and they set off to find the truth about Children of Destiny on a white Genryu."
  },
  {
    "id": 10207,
    "banner_id": 10020701,
    "part": 1,
    "chapter": 2,
    "talk": 0,
    "title": "Ep. 7 The Archfiend's Curse",
    "text": "Karman, who wished to become the Archfiend himself, appeared in Vanguard in disguise. Exuding an ominous aura of death, he fell before the might of Jo, who had completed her training with her mother, in addition to Polka, the Grave Knights, and the Otherworld Warriors. Karman's defeat, however, was part of a plan to fulfill Igomahl's prophecy. The Archfiend's curse took the form of the Cursed One."
  },
  {
    "id": 10208,
    "banner_id": 10020801,
    "part": 1,
    "chapter": 2,
    "talk": 0,
    "title": "Ep. 8 To Holy World Tower! Part 1",
    "text": "To fight the Cursed One floating over Vanguard, Jo's crew left for the World Tower to free its captive, the Matriarch. Visions of the tower showed the Maiden of Lance, a Child of Destiny, searching for her purpose in life.\n\nMeanwhile, Evelyn got closer to the truth of the Soul Inheritance ritual Shen Du underwent and learned that Dahao was still alive and could see Vanguard through Shen Du's eyes."
  },
  {
    "id": 10209,
    "banner_id": 10020811,
    "part": 1,
    "chapter": 2,
    "talk": 0,
    "title": "Ep. 8 To Holy World Tower! Part 2",
    "text": "Jo and company reached the top of the World Tower. The Maiden of Lance met her future self, who existed outside the world, and returned as the Matriarch. The party then returned to Vanguard and defeated the Cursed One. At that moment, Polka and Liz regained the memories Karman had stolen. Memories of Jo's little twin brother, Bertrand."
  },
  {
    "id": 10210,
    "banner_id": 10020901,
    "part": 1,
    "chapter": 2,
    "talk": 0,
    "title": "Ep. 9 Bertrand Lynn Wood",
    "text": "Jo's group departed from Vanguard in search of Bertrand. Sarah and the Matriarch attempted once again to reach the Young Boy's heart to get him back. Finally, Sarah's voice reached him and was able to stop him, but Bertrand had attained the power of the Abyss and awakened the Cursed Ones.\n\nMeanwhile, Evelyn visited Leonid's castle and retrieved her lost memories."
  },
  {
    "id": 10211,
    "banner_id": 10021001,
    "part": 1,
    "chapter": 2,
    "talk": 0,
    "title": "Ep. 10 Shen Du & The Abyss",
    "text": "The New Eight Stars battled the Cursed Ones while evacuating the people of Vanguard. Igomahl, who had assimilated with Dahao, appeared before them. Just as Shen Du's party was up against the ropes, Dahao appeared and used the last of her power to save them. She said she achieved the true Soul Inheritance and vanished.\nMeanwhile, Polka's group fought Bertrand, who possessed the power of the Abyss. Enraged that he had hurt her family, Jo fought her brother."
  },
  {
    "id": 10212,
    "banner_id": 10021101,
    "part": 1,
    "chapter": 2,
    "talk": 0,
    "title": "Ep. 11 Darkness of the Twin Stars",
    "text": "Jo fought Bertrand until they knocked each other out. She visited the isolated world, where the future Matriarch awaited. Jo spoke with her, learning the truth of the Divine and Demon Towers as well as Bertrand's past. Then, resolved to face her own darkness, she battled Bertrand again and claimed victory. With her words, she lit a light in Bertrand's heart, and he became part of the family again."
  },
  {
    "id": 10213,
    "banner_id": 10021201,
    "part": 1,
    "chapter": 2,
    "talk": 0,
    "title": "Ep. 12 New Vessel & Ballad of Battles Past",
    "text": "Bertrand had freed the soul of the fake Archfiend from the Abyss, a soul that would complete Igomahl's power had she a vessel to receive it. The world saw powerful beasts being summoned from other worlds, and the Otherworld Warriors were fighting them. Polka's party went to the Messina Empire to defeat the new vessel, Emperor Ludwig. However, Igomahl had already gained the power and trapped them in a place where they would battle for eternity."
  },
  {
    "id": 10301,
    "banner_id": 10210101,
    "part": 2,
    "chapter": 1,
    "talk": 0,
    "title": "Ep. 1 Liam & Door of Beginnings",
    "text": "Liam, a student at Marquisate University, became a pilot for Clavis, an organization looking into widespread incidents of people falling into a deep sleep. He piloted the Union, an inter-dimensional vessel. Together with Candy and some Otherworld Warriors, Liam went through a Door to another dimension, where he met a girl named Anya."
  }
]