[
  {
    "id": 1,
    "name": "Romancing SaGa Original Soundtrack -Remaster-",
    "flavor_text": "The Romancing SaGa series introduced the idea of a non-linear storyline to the world of RPGs. Enjoy music from Romancing SaGa, the starting point of the SaGa series, as you accompany the eight heroes on their legendary search for the Fatestones.",
    "icon": 1001,
    "sort_order": 2
  },
  {
    "id": 2,
    "name": "Romancing SaGa 2 Original Soundtrack -Remaster-",
    "flavor_text": "Romancing SaGa2 was a hit for its non-linear, freeform plot. This is a collection of RS2's background music that tells a grand tale through its colorful, lyrical content.",
    "icon": 1002,
    "sort_order": 3
  },
  {
    "id": 3,
    "name": "Romancing SaGa 3 Original Soundtrack -Remaster-",
    "flavor_text": "Soundtrack for the music in Romancing SaGa3, the last title in the Romancing series for the Super Nintendo that was renowned for its graphics, animation, and music. A collection of the original sounds from the game, this collection adds the perfect finishing touch to the story of eight heroes whose destinies lead them to change the fate of the world.",
    "icon": 1003,
    "sort_order": 4
  },
  {
    "id": 4,
    "name": "SaGa Frontier Original Soundtrack",
    "flavor_text": "Composer Kenji Ito shows off his musical versatility by producing 74 hits. Every character has their own unique final battle music. Enjoy each of the seven protagonists' endings, along with their own unique accompanying music.",
    "icon": 1004,
    "sort_order": 5
  },
  {
    "id": 5,
    "name": "SaGa Frontier 2 Original Soundtrack",
    "flavor_text": "Composer Masashi Hamauzu takes the lead in SaGa Frontier2. Using a base tune in several tracks creates a sense of unity. Discover the roots of Hamauzu and enjoy his world of music on this disc.",
    "icon": 1005,
    "sort_order": 6
  },
  {
    "id": 6,
    "name": "Unlimited:SaGa Original Soundtrack",
    "flavor_text": "Square Enix's first fully online RPG, UNLIMITED SaGa is well known for both its gameplay and musical scores. With Masashi Hamauzu as the lead composer, songs include a beautiful orchestra and feature a blend of various other styles of music such as jazz and Latin.",
    "icon": 1006,
    "sort_order": 7
  },
  {
    "id": 7,
    "name": "Romancing SaGa -Minstrel Song- Original Soundtrack",
    "flavor_text": "Soundtrack for the music in Romancing SaGa -Minstrel Song-, a remake of the original title. With new tracks like Ardent Rhythm and Melodies of Good and Evil, there are also many reimagined songs like Saurin Unchained - the Final Battle. The music alone makes this remake feel like a brand new title.",
    "icon": 1007,
    "sort_order": 8
  },
  {
    "id": 10,
    "name": "SaGa THE STAGE -Seven Heroes Return- Original Soundtrack",
    "flavor_text": "Soundtrack for SaGa THE STAGE -Seven Heroes Return- Original Soundtrack, based on the antagonists of Romancing SaGa2. Kenji Ito produced all new tracks for this theatrical production, and rearranged a familiar phrase for fans to enjoy. The music in this album can be enjoyed by those who've seen the show and those who haven't!",
    "icon": 1010,
    "sort_order": 11
  },
  {
    "id": 11,
    "name": "Romancing SaGa Re;univerSe Original Soundtrack",
    "flavor_text": "Original soundtrack for Romancing SaGa Re;univerSe. With all new songs and compositions by Kenji Ito that add more color to the new Romancing SaGa world.",
    "icon": 1011,
    "sort_order": 1
  },
  {
    "id": 16,
    "name": "The Final Fantasy Legend Original Soundtrack",
    "flavor_text": "The momentous soundtrack recorded for The Final Fantasy Legend, the first Game Boy game by SQUARE (at the time). Many pieces composed by Nobuo Uematsu have been rearranged and used throughout the SaGa series, and that SaGa sound has only expanded since. This is where the legend began.",
    "icon": 1016,
    "sort_order": 16
  },
  {
    "id": 17,
    "name": "The Final Fantasy Legend II Original Soundtrack",
    "flavor_text": "Nobuo Uematsu and Kenji Ito collaborated to create the soundscape for the second Game Boy title in the SaGa series. This was the monumental first title for Kenji Ito, who would later carry the torch of SaGa's music, so you can fully enjoy his signature sound. Hot battle tracks like Lethal Strike, Struggle to the Death, and Save the world pack a serious punch.",
    "icon": 1017,
    "sort_order": 17
  },
  {
    "id": 18,
    "name": "The Final Fantasy Legend III Original Soundtrack",
    "flavor_text": "Unlike the previous two titles, this one was the joint effort of Ryuji Sasai and Chihiro Fujioka. They did something new, creating soundtracks that used four sound channels, further emphasizing the rhythms and beats. Savor the different sonic flavors presented across the three Game Boy games.",
    "icon": 1018,
    "sort_order": 18
  }
]