[
  {
    "id": 10101001,
    "text": "Polka Lynn Wood and his little sister Liz are circus acrobats. One day, during a show, a demon appears and takes Liz away.\n\nAs Polka journeys the land looking for Liz, he learns that the Marquisate of Loanne is about to conduct an entrance exam for the Grave Knights. He decides to apply, hoping that joining the group would give him a lead, and sets off to Vanguard, where applicants are gathering."
  },
  {
    "id": 10101002,
    "text": "Led by Valdor, the Grave Knights' Commissioner, Polka heads for the exam area with the other candidates.\n\nValdor announces that the test will consist of conquering a tower, or a Grave.\n\nPolka leads five Otherworld Warriors into the tower that looms before them."
  },
  {
    "id": 10101010,
    "text": "The five Otherworld Warriors accompanying Polka are Hector, Gen, Cordelia, Herman, and Sif.\n\nThe towers are also known as Graves, for they resemble tombstones. It has been around a year since they began to pop up across the world."
  },
  {
    "id": 10101020,
    "text": "As they navigate the tower, Polka finds it strange that he doesn't see any other candidates. \n\nPolka is asked why he wants to become a Grave Knight when Sif suddenly senses the presence of demonic beasts. The party springs into battle as a horde appears from the shadows."
  },
  {
    "id": 10101030,
    "text": "Polka and company defeat the pack of demonic beasts. Sif mentions she's looking for Albert and asks if Polka is also looking for someone. Herman says he has a bad feeling. Meanwhile, Cordelia cheerfully takes the lead."
  },
  {
    "id": 10101040,
    "text": "A sea suddenly appears inside the tower. Polka nearly drowns since he cannot swim, and is saved by Hector. Herman warns the astonished Polka that Graves do not adhere to common sense.\n\nThe party spots a ship to the southwest and makes their way toward it."
  },
  {
    "id": 10101050,
    "text": "They arrive at the ship, which turns out to be the pirate ship of Black the pirate. Black tells Herman he's seen his face before, but Herman dismissively says he doesn't know him.\n\nBlack allows them on board on the condition that they help fight off monsters."
  },
  {
    "id": 10101060,
    "text": "While fighting, Black realizes that the monsters are a trap set by another pirate, Jackal. Herman then warns Black that Forneus is coming. Sif reminds Herman that the past is set in stone."
  },
  {
    "id": 10101070,
    "text": "The dark clouds Forneus brings with him are creeping closer to the pirate ship. Herman tells Black that this is the result of overconfidence in his own power.\n\nBlack snaps back, saying that Herman knows nothing about him. But Herman replies meaningfully that he knows him far too well."
  },
  {
    "id": 10101080,
    "text": "Black is overpowered by Forneus. Herman sighs, fully realizing that the past cannot be changed.\n\nGraves contain fragments of the Otherworld Warriors' pasts. When Polka asks what there is to gain from just peering into the past, Gen says the answer is at the top of the tower."
  },
  {
    "id": 10101090,
    "text": "Having left the sea, Polka's party wade through a jungle when a light appears before them. They advance, prepared for anything as they finally approach the top floor.\n\nBehind them, a faerie has been secretly observing the scene."
  },
  {
    "id": 10101100,
    "text": "The Doors of Light appear before Polka. Indeed, the doors await at the summit of every Grave. The Otherworld Warriors say it was through such doors that they came to this world.\n\nPolka opens the doors to free Black. The first to conquer the tower and free an Otherworld Warrior, Polka passes the exam to join the Grave Knights."
  },
  {
    "id": 10101110,
    "text": "After passing the entrance exam, Polka is granted an audience with Zenon Ausbach, the Marquis of Loanne, who assigns him to the 7th Division of the Loanne Corps as an official Grave Knight.\n\nZenon then gives Polka his first mission: to go to the Great Arch with Faerie and retrieve a captive astronomer named Shen Du."
  },
  {
    "id": 10102001,
    "text": "Zenon founded the Grave Knights to fight the growing number of demonic beasts with the help of Otherworld Warriors. Little is yet known regarding the Graves, but Shen Du's rescue is pivotal to learning the truth."
  },
  {
    "id": 10102010,
    "text": "The city-state of Trahza, where Shen Du is being held, is controlled by Don Scaccini, a weapons dealer. \n\nSpearheading a group of Otherworld Warriors, Polka advances upon the city, which is armed with defenses and demonic beasts."
  },
  {
    "id": 10102020,
    "text": "Polka's group makes a beeline for the Scaccini Manor through an undersea tunnel. According to Faerie, the paranoid Scaccini has put up a solid defense on the single route leading to the manor. The party continues down the tunnel where demonic beasts already lie in wait."
  },
  {
    "id": 10102030,
    "text": "A legend passed down to the present day tells of the Eight Stars, heroes who saved the world from destruction 300 years past. Mikhail, Monika, Katarina, Khalid, Thomas, Julian, and Ellen. The eighth star, however, is unknown.\n\nEllen, who travels with Polka's group, says she doesn't know who the eighth is, either."
  },
  {
    "id": 10102040,
    "text": "Ellen, who is in the group as an Otherworld Warrior, shares that her present state is that of a settler, prior to becoming a hero.\n\nWhile they speak, the party arrives at the tunnel's exit."
  },
  {
    "id": 10102050,
    "text": "Scaccini, aware of the intrusion of Polka's group, has tightened security around the manor.\n\nThe group splits up into two. Valdor, Guella Ha, Terry, and Gen will cause a diversion while Polka and the rest sneak into the dungeon."
  },
  {
    "id": 10102060,
    "text": "Faerie, who is familiar with the manor's interior, reveals that they once lived there.\n\nAs the party proceeds with Faerie's guidance, they come face-to-face with Scaccini's henchmen."
  },
  {
    "id": 10102070,
    "text": "Scaccini is a collector of rare creatures.\n\nFaerie, the last of their kind, was once part of his collection, locked up in the dungeon. That is, until Valdor, who also works as an Endangered Species Protection Officer, saved them.\n\nFaerie is assisting Valdor with his work to repay him."
  },
  {
    "id": 10102080,
    "text": "There are two kinds of Graves: Divine Towers, holding the Otherworld Warriors, and Demon Towers, which contain demonic beings. Faerie recounts how Scaccini is having his men to the Demon Towers and subjugating the beasts therein.\n\nAt that moment, a Demon Tower with a powerful, evil aura appears in Trahza, and as it does, Polka hears a mysterious voice."
  },
  {
    "id": 10102090,
    "text": "Polka and company reach the dungeon and split up to look for the captive astronomer.\n\nBehind them, a mysterious figure secretly activates a mechanism to close off their escape route."
  },
  {
    "id": 10102100,
    "text": "Polka's crew finds the imprisoned Shen Du. Heeding his warning that they will be trapped like rats in a cage if the passageway is blocked, they rush to escape."
  },
  {
    "id": 10102110,
    "text": "Several days after the successful extraction of Shen Du...\n\nZenon receives a missive from Messina's Emperor Fegan. It urges him to prepare for battle with the eastern country of Dae."
  },
  {
    "id": 10103001,
    "text": "Polka's next mission is to search with Shen Du for the missing Chief Astronomer Ren Dahao.\n\nShe is said to be Shen Du's master and possesses an unusual talent."
  },
  {
    "id": 10103010,
    "text": "According to Shen Du, Dahao's talent is the ability to see the future.\n\nHawke and Guella Ha sense the presence of demonic beasts. The party has encroached upon one of their nests."
  },
  {
    "id": 10103020,
    "text": "Before departing from Dae, Dahao left word that she would visit the Bat King of Podorui. Relying on that knowledge, Polka's party heads through the forest to Podorui."
  },
  {
    "id": 10103030,
    "text": "Ellen has met the Bat King 300 years ago. According to her, he's a vampire and has lived much longer than humans.\n\nMeanwhile, Barthelemy the clown and two assassins are following Polka's party while they traverse the woods."
  },
  {
    "id": 10103040,
    "text": "Polka and company reach the castle at Podorui, but the townsfolk claim that no one lives there.\n\nHowever, the group finds indications that someone has passed by, so they search the area and find a door leading underground."
  },
  {
    "id": 10103050,
    "text": "Polka's party cuts through the demonic beasts and arrives at a hall with rows of coffins.\n\nFrom the coffins' shadows, the assassins hired by Scaccini emerge. Hawke and Ellen draw their attention while Polka and the others escape through a passage off to the side."
  },
  {
    "id": 10103060,
    "text": "The party finds out from the assassins that Scaccini has put a bounty on their heads.\n\nMeanwhile, Polka picks up a feather of a bird he has seen before."
  },
  {
    "id": 10103070,
    "text": "Using a communication device made by Otherworld Warrior Hiraga XVI, Polka apprises Valdor's group of the situation.\n\nFaerie is shocked when they see the feather Polka picked up."
  },
  {
    "id": 10103080,
    "text": "Valdor and Faerie warn Polka against meeting Barthelemy, the owner of the feather.\n\nPolka heeds their words and tries to escape with the others, but a terrible beast stands in their way."
  },
  {
    "id": 10103090,
    "text": "The party has defeated Yami. They continue on their way.\n\nShen Du mentions that Dahao may have talked to the vampire to learn about the past.\n\nAround this time, Barthelemy has also defeated Yami. However, instead of chasing after Polka and company, he heads home."
  },
  {
    "id": 10103100,
    "text": "Polka's group manages to meet with the castle's lord, Count Leonid. He perceives what Polka truly wants and prompts him to peer into the Holy Grail.\n\nReflected on the water surface is an image of his sister Liz, trapped in a cave."
  },
  {
    "id": 10103110,
    "text": "Polka tries to look inside the Holy Grail time and again, but he gets no more information on Liz or Dahao.\n\nBeasts begin to chase, so the party flees from the castle."
  },
  {
    "id": 10104001,
    "text": "Zenon launches a search for Polka, who has gone missing following the mission to Podorui. According to Zenon's aide, Karman, Polka has found out that the cave where Liz is trapped is to the east, and he's left with a small group to rescue her.\n\nZenon and Karman are concerned that Polka might cause an altercation with the country of Dae, and that Loanne would be the trigger for war."
  },
  {
    "id": 10104010,
    "text": "Polka is heading east on his own. Valdor and the Otherworld Warriors follow him and reprimand him for going rogue.\n\nPolka says he's going to look for his sister, even if it means leaving the Grave Knights, and Valdor's group offers to accompany him."
  },
  {
    "id": 10104020,
    "text": "Polka and the others come across a mysterious girl, Dorte, who says she is being chased by Daean soldiers. Ellen offers to escort her home.\n\nSuddenly, they're attacked by those very soldiers. The party disperses, and they all run away to avoid fighting."
  },
  {
    "id": 10104030,
    "text": "Polka's group is unable to shake off the Daean soldiers. Claudia and Ellen draw their attention, allowing Polka and Terry to get away.\n\nAround this time, Faerie is trying to contact Polka through the communication device, but he has turned it off."
  },
  {
    "id": 10104040,
    "text": "Valdor and Gustave have found out what is going on from Dorte. She tells them she's being pursued because she's one of the witch's daughters.\n\nNext thing they know, they're attacked by Tu Kwai, ruler of Dae. Tu Kwai offers them their lives if they surrender Dorte."
  },
  {
    "id": 10104050,
    "text": "While running away, Polka and Terry notice a figure floating above a lake. As soon as the figure vanishes, a twister occurs, leaving in its place a Grave.\n\nThe two are shocked but are forced to leave in haste as the Daean soldiers are right on their heels."
  },
  {
    "id": 10104060,
    "text": "Valdor and Gustave challenge Tu Kwai, but are outmatched by Tu Kwai's speed and soon captured.\n\nWhen the Daean ruler presses them to reveal who they are, Gustave truthfully identifies himself as one of Loanne's Grave Knights. Upon hearing this, Tu Kwai says that the two cannot be spared."
  },
  {
    "id": 10104070,
    "text": "Claudia and Ellen shake off their pursuers, though wounded. \n\nThe two say they can't leave Polka in danger. Claudia also wants to help save Liz, but Ellen says they need to find out about the powers of the Wicked Witch of the East first."
  },
  {
    "id": 10104080,
    "text": "According to Tu Kwai, the Wicked Witch of the East kidnaps girls with innate magical power, makes them her daughters, teaches them magic, and has them commit crimes such as thievery. Dorte denies doing any such misdeeds. Valdor and Gustave also insist on their innocence.\n\nHowever, Tu Kwai doesn't believe them and orders their execution."
  },
  {
    "id": 10104090,
    "text": "Polka and Terry have watched Tu Kwai's interrogation in secret. They hatch a plan to rescue the others where Terry would act as a decoy.\n\nTu Kwai receives a report from one of the soldiers. Hearing that two women have stepped into the witch's domain, Polka and Terry realize they are talking about Ellen and Claudia, so they spring into action to rescue Valdor's party."
  },
  {
    "id": 10104100,
    "text": "Polka successfully rescues Valdor and company. As he hurries to help Ellen and Claudia, Valdor informs him that Dorte is one of the witch's daughters. Dorte chimes in, saying she'll guide them to the cave."
  },
  {
    "id": 10104110,
    "text": "While monitoring Dorte through a crystal ball, the Wicked Witch of the East comes to the realization that this young man, Polka, is Liz's brother.\n\nShe mutters that Liz is her fated child and that Polka must not take Liz back.\n\nMeanwhile, the captive Liz fears for her brother's safety and prays for his escape from the Kalmya Caverns."
  },
  {
    "id": 10105001,
    "text": "Zenon meets with Messina's Emperor Fegan. The emperor anticipates the country of Dae using the conflict with the Grave Knights as an excuse to launch an attack, and so he plans to attack Dae preemptively.\n\nAfter Emperor Fegan leaves, Zenon summons Shen Du."
  },
  {
    "id": 10105010,
    "text": "As the group follows Dorte's lead through the cave, her sister, another daughter of the witch, appears before them. She warns Dorte that the witch will kill them all if she helps Polka's group. Dorte goes with her, leaving the party behind."
  },
  {
    "id": 10105020,
    "text": "While exploring the cave with Ellen, Claudia triggers a trap and gets caught in a cage of thorns. They realize from the thorns' magic that they've entered the witch's cave.\n\nEllen protects Claudia by fending off the approaching demonic beasts."
  },
  {
    "id": 10105030,
    "text": "Stranded, Polka's crew notices some arrows drawn on the walls. They are signs Dorte left behind that lead to the witch.\n\nAround that time, Faerie, Herman, and Sif arrive at the cave's entrance in pursuit of Polka's crew."
  },
  {
    "id": 10105040,
    "text": "Polka's party is ambushed by some of the witch's daughters. Terry, who has gone separately, is captured. Gustave tries to save him, but a magic circle created by the witch's daughters blocks him.\n\nTerry steels himself and fights back, disrupting their formation. Terry gets killed when they counterattack, but in their disarray, Polka's group is able to go through."
  },
  {
    "id": 10105050,
    "text": "Ellen is still fighting to protect Claudia, but her strength is nearly spent.\n\nIt is then that Faerie, Herman, and Sif arrive. They step in to face the beasts in her stead."
  },
  {
    "id": 10105060,
    "text": "Valdor tells Polka an old story of when Terry became the head of the Dragon Lair.\n\nValdor says that in Terry's eyes, Polka was the emperor. Hearing this gives Polka a lot to consider."
  },
  {
    "id": 10105070,
    "text": "Faerie and company defeat a pack of demonic beasts.\n\nFaerie then breathes on the thorns, causing them to wither, and frees Claudia. This is the only magic Faerie can do."
  },
  {
    "id": 10105080,
    "text": "The witch visits the imprisoned Liz. She lets Liz know that her brother has come to rescue her."
  },
  {
    "id": 10105090,
    "text": "Polka's group is happy to see Faerie and the others join them.\n\nEllen notices that Terry isn't with the others and learns that he died to protect Polka and the others.\n\nBut now, as they know they must first focus on rescuing Liz, they move on."
  },
  {
    "id": 10105100,
    "text": "The party reaches the deepest part of the cave and confronts the witch.\n\nPolka yells at her, demanding to have his sister back. The witch refuses, and so the battle begins."
  },
  {
    "id": 10105110,
    "text": "Dorte visits Liz's cell. She asks Liz to help her save Polka and company.\n\nDorte has the ability to bring out the power in others. She awakens the Genbu magic that had been dormant within Liz."
  },
  {
    "id": 10106001,
    "text": "Having driven back the witch, Polka's group was unable to rescue Liz.\n\nValdor and company visit Terry's grave while Polka heads to the Ache Woods on a mission. Karman plans to bring a group of Otherworld Warriors to follow Polka, but among them is Terry, who should've been dead."
  },
  {
    "id": 10106010,
    "text": "On his way to the Ache Woods, Polka is gripped with regret for causing Terry's death.\n\nMeanwhile, Zenon makes for the town of Lance with Shen Du."
  },
  {
    "id": 10106020,
    "text": "Karman's squad is following Polka by ship.\n\nThey discuss the mysteries of the Graves. According to Karman, Graves preserve a specific moment in another world's past. A wealth of moments exists for every Otherworld Warrior."
  },
  {
    "id": 10106030,
    "text": "Polka's group visits the Ache Woods to ask for assistance from the people of Gessiah, who were chased out of their country.\n\nHaving heard that their leader is a warrioress named Madeleine, Sif is looking forward to meeting her."
  },
  {
    "id": 10106040,
    "text": "As they walk through the desert, Cordelia asks Ginny about her family. However, Ginny does not answer. Valdor has warned her not to say anything as one mustn't know about their future.\n\nAt the same time, Polka's party is crossing a river by boat. They note that Madeleine is the reincarnation of the hero Khalid."
  },
  {
    "id": 10106050,
    "text": "Barthelemy the clown visits Scaccini to negotiate a higher pay. Facing the one who conquered a Demon Tower and subjugated Kzinssie, one of the Seven Heroes, Scaccini agrees to a higher pay and orders the retrieval of Shen Du and Faerie."
  },
  {
    "id": 10106060,
    "text": "Shen Du and Zenon follow a mountain path and reach a town.\n\nZenon asks about a book penned by Dahao. Shen Du seems to consider that very book to be the culmination of Dahao's research."
  },
  {
    "id": 10106070,
    "text": "Cordelia says she will stop thinking of the future. Claudia remarks that the future is something that changes, but Faerie feels some futures cannot be changed.\n\nMeanwhile, Valdor asks Karman his reason for working for Zenon. Karman says he wants to see a world governed by Zenon. Valdor agrees."
  },
  {
    "id": 10106080,
    "text": "Zenon and Shen Du visit a cave where it is rumored you can hear a voice.\n\nThe voice calls to Ellen. However, they cannot find the owner of the voice."
  },
  {
    "id": 10106090,
    "text": "After crossing the river, Polka's crew is met with a Grave.\n\nPolka recalls what happened right before he headed for the witch's cave. He's certain the figure he saw created the tower."
  },
  {
    "id": 10106100,
    "text": "Polka meets up with Karman's squad. He's stunned to see Terry again, but Karman explains that he's a Terry from another moment. They all head to the ruins where the people of Gessiah are gathered.\n\nBarthelemy and Kzinssie are right on their tail. Kzinssie proposes launching a surprise attack, but Barthelemy dismisses it."
  },
  {
    "id": 10106110,
    "text": "On their way to the ruins, the party hears a voice warning them to go no further. Sif challenges the speaker to show themselves. Then Madeleine, the warrioress, obliges and reveals herself.\n\nPolka tries to keep them from fighting, but Valdor seems to be interested in their battle."
  },
  {
    "id": 10107001,
    "text": "Sif and Madeleine face off. Madeleine is impressed when she discovers that Sif is an Otherworld Warrior.\n\nMadeleine then says she cannot aid Loanne as she must search for the Khamsin. She guides them to the inner part of the ruins-turned-fortress."
  },
  {
    "id": 10107010,
    "text": "The Kingdom of Naj, which had been reconstructed 300 years past, was destroyed again a few years before. The people in the fortress are its remnants.\n\nAround this time, Zenon and Shen Du arrive in the town of Lance. However, there's no trace of anyone there."
  },
  {
    "id": 10107020,
    "text": "Within the ruins lay some firewood, its flames extinguished. According to Madeleine, this is the Undying Flame, a fire that wards off evil that burned for hundreds of years and went out. In Gessian legend, when the Undying Flame goes out, so will the sun.\n\nThe party follows Madeleine deeper still."
  },
  {
    "id": 10107030,
    "text": "The group arrives in front of a mural depicting the calamity from 300 years ago. In it, the sun is concealed by the Dark Star.\n\nMeanwhile, Barthelemy and Kzinssie find that Polka's group has entered the ruins."
  },
  {
    "id": 10107040,
    "text": "With Madeleine guiding Polka's party inside the ruins, they somehow still get lost.\n\nMeanwhile, Zenon and Shen Du discover a hidden passage beneath the tomb of the Matriarch. Zenon surmises that Dahao may have visited."
  },
  {
    "id": 10107050,
    "text": "Polka and company run into Barthelemy the clown. Barthelemy was once the ringmaster of Polka's circus troupe, but he was also a famous assassin in the criminal underworld.\n\nValdor proposes a retreat. Gray agrees, sensing an evil aura about Barthelemy."
  },
  {
    "id": 10107060,
    "text": "Terry recognizes the shadow creeping behind Barthelemy as Kzinssie, one of the Seven Heroes.\n\nThen, upon learning the existence of a mighty foe, Madeleine and Sif's competitive spirit burns, and they turn it into a competition to see who takes him down first."
  },
  {
    "id": 10107070,
    "text": "Polka and company witness a group of heroes battling Aunus, one of the Four Sinistrals. It is a vision, a fragment of a world's past. That's when they realize the fortress they entered has, at some point, become a Grave.\n\nSo, they make for the summit to free the Otherworld Warrior."
  },
  {
    "id": 10107080,
    "text": "Wil says he's had a bad feeling for a while. Polka's group is soon convinced that this Grave, with its oppressive air, is in fact a Demon Tower.\n\nBarthelemy intentionally lets the group escape so that he can hunt his frightened prey. It seems he has yet to forgive Polka for abandoning the circus."
  },
  {
    "id": 10107090,
    "text": "The party reaches the top floor only to find a mighty demonic beast guarding the doors they intend to open.\n\nZenon's group, who is exploring Lance's underground, meets Lance astronomers who have been in hiding. They say Dahao left the town after sharing a prophecy with them."
  },
  {
    "id": 10107100,
    "text": "Polka's party defeats the beast and goes to open the doors. Karman warns them against opening the doors of a Demon Tower. However, Polka proposes releasing the demonic beast and pitting it against Barthelemy's Kzinssie to give themselves a chance to escape. Not wanting to lose any more friends, Polka says he wishes to avoid any unnecessary fights."
  },
  {
    "id": 10107110,
    "text": "Polka's strategy works, and the party successfully escapes the tower. Madeleine says her quest for the Khamsin prevents her from joining them.\n\nPolka tells her that he has his own wish as well and that everyone can work together to fulfill their wishes. At this, she finally agrees to go with them."
  },
  {
    "id": 10108001,
    "text": "After returning from the Ache Woods, Polka is tasked with retrieving Liz from the Wicked Witch of the East.\n\nZenon entrusts Karman with a letter to Tu Kwai, the Daean ruler, to explain the situation. This is a risky plan, as it may make an enemy of the Empire."
  },
  {
    "id": 10108010,
    "text": "Polka, Valdor, and the Otherworld Warriors head to the witch's cave on a snowy mountain path.\n\nThere are three entrances to the cave, and the plan is for three units, including Polka's, to attack simultaneously. \n\nPolka hurries along the mountain path, pushing Awe, who is weak against the cold."
  },
  {
    "id": 10108020,
    "text": "Barthelemy and Kzinssie are also near the witch's cave. Barthelemy uses a spell to cover the area in a thick fog, and an entrance to the cave appears on a cliff wall.\n\nSoon after, Polka's group reaches this entrance created by Barthelemy."
  },
  {
    "id": 10108030,
    "text": "Polka and the others are about to step into the cave when a great earthquake shakes the land, and countless Demon Towers appear. Although surprised, the group knows rescuing Liz is their priority and enters the cave."
  },
  {
    "id": 10108040,
    "text": "Polka and the Otherworld Warriors make their way through the cave, talking as they go.\n\nAt this time, Don Scaccini, feeling uneasy about Barthelemy's inability to finish off Polka, dispatches a pair of ogre assassins. Maximus, another of Scaccini's brutes, begins to look into Barthelemy."
  },
  {
    "id": 10108050,
    "text": "With Dorte's signs gone, Polka and crew must rely on their memory to navigate the cave.\n\nMeanwhile, Emperor Fegan receives word that Huang's soldiers were surrounded by beasts and annihilated. He orders an investigation to learn more."
  },
  {
    "id": 10108060,
    "text": "The Otherworld Warriors share their experience of being freed from the doors and recall hearing a voice urging them to help the Grave Knight before them.\n\nMeanwhile, Barthelemy and Kzinssie lay in wait in the innermost part of the cave."
  },
  {
    "id": 10108070,
    "text": "This is several hours before.\nThe Otherworld Warriors waiting at the real entrance to the cave also bear witness to the emergence of the Demon Towers."
  },
  {
    "id": 10108080,
    "text": "Emperor Fegan orders the withdrawal of the forces invading Dae and heads toward Vanguard to meet with Zenon and ask about Dahao's prophecy. He, too, gets a feeling that the world is about to change."
  },
  {
    "id": 10108090,
    "text": "Polka's party listens to Sophia tell of her world, of Inheritance Magic and the Seven Heroes.\n\nBarthelemy, who has succeeded in drawing in Polka and the others, is trying to further transform his illusory cave."
  },
  {
    "id": 10108100,
    "text": "Kzinssie awaits Polka's group inside the cave.\n\nBattle ensues. They face an enemy with a technique that will surely kill its target."
  },
  {
    "id": 10108110,
    "text": "Kzinssie uses his ultimate technique, Soulsteal. Sophia, who has inherited the power of Emperors past, sees through Soulsteal and defeats Kzinssie.\n\nIn the witch's cave, Liz continues to train in Genbu magic alongside Dorte. It had been Liz's power that stopped the witch from pursuing Polka's group before."
  },
  {
    "id": 10109001,
    "text": "Zenon speaks to Mikhail, former Marquis of Loanne, who has been freed from a Grave.\n\nMikhail tells him that even the one who stole the memories of the girl called Sarah will not be able to change what happened in the past."
  },
  {
    "id": 10109010,
    "text": "Upon defeating Kzinssie, Polka and company find themselves in front of a circus tent. The only way to escape an illusion is to defeat the illusionist, so they press on to take down Barthelemy."
  },
  {
    "id": 10109020,
    "text": "The Otherworld Warriors have reservations about Zenon's decision to mobilize the Grave Knights to save Liz. However, Valdor says that even though he does not know Zenon's true intentions, if it is Zenon's command, they have a duty to risk their lives to carry it out.\n\nPolka thanks them for their help in rescuing his sister."
  },
  {
    "id": 10109030,
    "text": "Inside the circus tent, Barthelemy confronts Scaccini's lackeys. He gives his parrot Magholi a command, and she transforms into a demonic beast and attacks them.\n\nPolka and the others are struggling to fend off the endless assault of beasts as they make their way to the tent. They take a defensive formation and proceed with caution."
  },
  {
    "id": 10109040,
    "text": "Karman and the southern unit have reached the rendezvous point in the real cave of the witch and have waited for Polka's group. They conclude they can wait no longer and decide to proceed.\n\nPolka's group presses on to try to escape the illusion, trusting that Karman and the others are still carrying out the plan."
  },
  {
    "id": 10109050,
    "text": "Barthelemy puts to use one of Scaccini's lackeys and seems to be planning something.\n\nValdor fears the circus tent is likely a trap, but Polka is certain Barthelemy is waiting inside. They shake off their nerves and keep moving forward."
  },
  {
    "id": 10109060,
    "text": "Emperor Fegan visits Vanguard, but upon learning that Zenon is absent, he decides to return to Messina and send soldiers to Vanguard. He wishes to capture Zenon and ask about Dahao's book.\n\nWhile Polka is trying to save his sister, Emelia tells him there is someone she wants to see as well."
  },
  {
    "id": 10109070,
    "text": "Polka's group finally reaches the circus tent. At the same time, while making his way through the real cave, Shen Du triggers a trap of thorns. Faerie blows the magic away and saves him.\n\nFaerie says that they can nullify magic but cannot use it against magic that is too great."
  },
  {
    "id": 10109080,
    "text": "Inside the circus tent, Barthelemy is waiting.\n\nIn the depths of the witch's cave, the Wicked Witch of the East peers into her past through a crystal ball. Having once lost her family, she vows never to let anyone hurt her family again."
  },
  {
    "id": 10109090,
    "text": "Barthelemy attacks the group, saying that he's going to punish Polka and Liz for leaving the circus without permission.\n\nIn the real cave, the Otherworld Warriors keep pushing forward in the hopes of meeting up with the third unit."
  },
  {
    "id": 10109100,
    "text": "Polka and company have defeated Barthelemy. With the illusion dispelled, they find themselves back at the real entrance to the cave. They infiltrate the witch's cave at last.\n\nHowever, what they defeated was one of Scaccini's lackeys transformed into Barthelemy. The real Barthelemy leaves, saying that he is always watching Polka."
  },
  {
    "id": 10109110,
    "text": "Maximus has been shadowing Barthelemy until Barthelemy's Shucho magic blocks his path with a wall of flames.\n\nZenon receives a report that Messina's forces have had Vanguard surrounded. So, he heads there, leaving Loanne in Mikhail's hands."
  },
  {
    "id": 10110001,
    "text": "Mikhail returns to lead Loanne in Zenon's place. He orders soldiers to defend Demon Towers around the world to keep the power of demonic beasts from falling into the wrong hands.\n\nHe chooses not to call back Polka's group. He believes Polka's love for his sister will give him strength."
  },
  {
    "id": 10110010,
    "text": "Polka and company can feel themselves getting surrounded as they proceed through the cave. The witch's powerful daughters are showing hostility toward them, but Polka keeps going, determined to save his sister."
  },
  {
    "id": 10110020,
    "text": "On Zenon's orders, the Otherworld Warrior pirates are sailing a foggy sea.\n\nEventually, a massive Grave appears before them. It is their destination: the World Tower."
  },
  {
    "id": 10110030,
    "text": "Polka's unit rendezvous with Karman's. They sense the witch's power gradually increasing.\n\nIn the deepest reaches of the cave, the Wicked Witch of the East is gathering her daughters' magic power to crush the party's hopes."
  },
  {
    "id": 10110040,
    "text": "Zenon is detained in a chamber within Messina Castle. Emperor Fegan suspects the Marquisate of Loanne is about to turn against the Messina Empire.\n\nZenon's concern is that Dahao's prophecy will come to be, and calamity will strike again."
  },
  {
    "id": 10110050,
    "text": "Liz senses that Polka has come to the cave. She means to go to him, but Dorte stops her. Dorte explains that to save him, Liz will once again need to use the power of Genbu, which thwarted the witch before. So, Liz continues to train until the time when her power is truly needed."
  },
  {
    "id": 10110060,
    "text": "The pirates have accomplished their mission of locating the World Tower. They set sail again, but soon a ghost ship closes in on them. Aboard this ghost ship is a pirate named Garon who launches an assault on them."
  },
  {
    "id": 10110070,
    "text": "Polka and the others make for the innermost part of the cave while battling the witch's daughters. In an attempt to stop them, the daughters use a powerful spell together. Faerie desperately uses their power to nullify the spell, but the cost of countering magic that strong is high. Faerie's body turns to stone."
  },
  {
    "id": 10110080,
    "text": "The pirates are fighting a losing battle against the endlessly reanimating beasts of the ghost ship. That's when a ship helmed by the pirate Selma comes to their side. She gives the command, and her ship charges toward the ghost ship."
  },
  {
    "id": 10110090,
    "text": "Polka's party faces the Wicked Witch of the East at last.\n\nPolka has come this far with the help of a great many comrades, Faerie, Valdor, Terry, and the other Otherworld Warriors.\n\nHe challenges the witch, his heart filled with determination to rescue Liz once and for all."
  },
  {
    "id": 10110100,
    "text": "After defeating the witch, Polka reunites with Liz, who has escaped from her cell. However, an evil energy flows from the fallen witch, an air of death creeping ever closer. On the brink of their doom, Liz transforms into a water dragon using Genbu magic. She carries the group and flees the cave.\n\nDorte decides to stay behind and slowly approaches her mother."
  },
  {
    "id": 10110110,
    "text": "The party made it out of the cave on Liz's back, who had transformed into a water dragon.\n\nValdor realizes that Faerie is still alive and says there may yet be a way to save them. But first, they return to Vanguard with Liz.\n\nMeanwhile, Count Leonid appears at the fallen witch's side. As the curse that prolonged her life is about to be lifted, he gives her some of his blood."
  },
  {
    "id": 10111001,
    "text": "Since reuniting with Liz, Polka has been having frequent dreams about his father.\n\nIn order to save Faerie, who has turned to stone to protect them during the battle in the witch's cave, Polka and company head for the Hidden Hamlet of the faeries."
  },
  {
    "id": 10111010,
    "text": "Karman believes the reason Emperor Fegan captured Zenon is the letter to Dae's leader. However, Mikhail seems to think the Emperor's truly after Zenon's insight, as he noticed the ill omens before anyone else.\n\nHow will the great nations act in the face of the calamity's return? The world is about to see major changes."
  },
  {
    "id": 10111020,
    "text": "The party walks through the forest, taking turns carrying Faerie on their backs.\n\nPolka and company are about to meet an old friend of Valdor's. This friend travels far and wide and may know how to reach the Hidden Hamlet."
  },
  {
    "id": 10111030,
    "text": "Polka and the others are trying to borrow a boat to cross to a floating island, but negotiations with the owner aren't going well. However, Tatyana pays the asking price and seals the deal. It seems she received warm welcome, money, and gifts when she stopped by Ryblov before."
  },
  {
    "id": 10111040,
    "text": "After defeating the pirate Garon, the Otherworld Warrior pirates are running out of rations from the long voyage and damages from the attack. Selma proposes harpoon fishing, and they try to make due until Vanguard.\n\nAnd so they sail, musing over who could be waiting in the massive World Tower."
  },
  {
    "id": 10111050,
    "text": "Waiting for them on the floating island is Edward of the Lobster Clan. He's on a journey to search for World's End, but helps the group as they head to the Hidden Hamlet of the faeries."
  },
  {
    "id": 10111060,
    "text": "According to Edward, the path to the faeries' Hidden Hamlet is shrouded by a dense fog. One must do something specific to reveal the path.\n\nHe throws a rock at a beehive, and the fog clears away, revealing the hidden path. They follow the path, but Polka, who's carrying Faerie, cannot get away fast enough and is stung by the bees."
  },
  {
    "id": 10111070,
    "text": "Mikhail and Gray have captured the merchant who leaked intel to Emperor Fegan, and they try to find out the source of the intel.\n\nAccording to Mikhail, who has read Dahao's Book of Prophecies, Zenon was trying to rescue Liz to bring together the New Eight Stars mentioned in the prophecy."
  },
  {
    "id": 10111080,
    "text": "The faeries of the Hidden Hamlet say the petrified Faerie is still alive. After learning that they can save Faerie with a special medicine, Polka's party heads to a cave in the east to pick up medicinal herbs."
  },
  {
    "id": 10111090,
    "text": "As the group struggles to fend off demonic beasts, they find the medicinal herbs. However, a particularly strong beast is nested beside the herbs. Since Polka has overexerted himself, Valdor and the others let him rest and take on the beast themselves."
  },
  {
    "id": 10111100,
    "text": "A few days have passed after giving Faerie the medicine. The petrification has been lifted, but Faerie remains unconscious. The Hamlet's faerie says that if they come up with a name for Faerie and call them by it, they will surely wake up. Tatyana names them Brownie, and when Polka and the others call them that, Brownie opens their eyes."
  },
  {
    "id": 10111110,
    "text": "Leonid has given Evelyn, the Wicked Witch of the East, some blood. The woman who has had everything taken from her by the Archfiend leaves Leonid's castle and sets out.\n\nIn a dream, Polka learns that his father has cast a spell to make him forget things. And his father tells Polka he is always watching over them."
  },
  {
    "id": 10112001,
    "text": "After returning from the Hidden Hamlet, Polka tries to keep Liz away from battle. However, Liz refuses to listen and storms out.\n\nJust then, Julian arrives with a message for Polka to go see Mikhail."
  },
  {
    "id": 10112010,
    "text": "Polka's crew is on a mission to investigate a haunted house in a village called Sinon.\n\nBrownie, as per usual, scolds Polka for suggesting that this mission should be given to rookies. It seems they're the same old Faerie on the inside."
  },
  {
    "id": 10112020,
    "text": "Mikhail sees some of his past self in Polka, who is trying to keep Liz from getting involved with the Grave Knights.\n\nMikhail departs with Katarina, Thomas, Ellen, and Monika, to do what he must."
  },
  {
    "id": 10112030,
    "text": "Along the way, Polka and the others discuss the Dark Star and the calamity it brings.\n\nThe Rise of Morastrum is a calamity wherein the Dark Star blots out the sun, and all life born that year is reaped.\n\nJulian has lost his sister to the Rise of Morastrum."
  },
  {
    "id": 10112040,
    "text": "Mikhail's group visits the treasure cave in the Great Arch in search of the dolphin figurine hidden by Black. The Otherworld Warrior Black in this world is from a time when he does not yet know the hiding place.\n\nLikewise, none of the other warriors have any memory of its hiding place, so they continue their search relying on documents."
  },
  {
    "id": 10112050,
    "text": "As it turns out, the haunted house in Sinon Village is a pub. It should've been empty, but a customer is inside. Princess White Rose sees that the customer is not human. Meanwhile, Julian is surprised the pub is still standing after 300 years.\n\nAt the same time, in Vanguard, Liz is worried her brother will see her fighting, so Robin suggests wearing a disguise."
  },
  {
    "id": 10112060,
    "text": "Suddenly, things inside the pub start to vanish, and the customer says this world is in flux. She identifies herself as Evelyn, a witch. She senses that beasts are drawing near to the pub.\n\nEvelyn relays a message to Julian from Sarah: \"Julian, protect this Land of Beginnings.\""
  },
  {
    "id": 10112070,
    "text": "Polka's party fights back against the horde of demonic beasts that flock to the pub. Yet they realize they're at a positional disadvantage, so they escape into the woods.\n\nMeanwhile, at Justerm's Demon Tower, Barthelemy has broken through the Loanne soldiers' defenses. He then begins to make his way up the tower while Magholi sings."
  },
  {
    "id": 10112080,
    "text": "There is no end to the demonic beasts, and Polka's party is barely getting by. That's when Robingirl, a masked ally of justice, swoops in gallantly. Polka and Brownie immediately recognize that she is actually Liz.\n\nMikhail's group ventures deeper into the treasure cave as they search, guided by Black's song and the murals."
  },
  {
    "id": 10112090,
    "text": "With Liz and Evelyn's assistance, Polka and his crew are able to drive the beasts away. The strange events surrounding the pub seem to settle down, but then Abyssal demons appear.\n\nEvelyn says that the place is the Land of Beginnings, where the world regenerated, and that if they lose it, the world will come to ruin."
  },
  {
    "id": 10112100,
    "text": "Mikhail's party has made it to the location of the treasure, but someone put them to sleep and stole the dolphin figurine.\n\nPolka and the others fight back against the never-ending waves of Abyssal demons. It seems Evelyn knows something about the source of the demons..."
  },
  {
    "id": 10112110,
    "text": "Gray was able to extract information on the employer of the detained merchant. He orders Yang Fan to apprehend Karman. Just then, the ground beneath Vanguard begins to shake. Karman has used the dolphin figurine to activate Vanguard.\n\nIn the meantime, Polka and the others have vanquished the Abyssal demons. Evelyn says that this world is a regenerated world and recounts the things she heard from Leonid."
  },
  {
    "id": 10113001,
    "text": "Within the Messina Empire, Zenon's plans are in motion.\n\nShen Du and the Otherworld Warriors have snuck into the bodyguards' residence.\n\nZenon advances through the sewers by himself to rendezvous with Shen Du and company."
  },
  {
    "id": 10113010,
    "text": "Several days before Zenon's capture by the Empire...\n\nZenon reveals to Mikhail and Gray that his letter to Dae is a plan to uncover the traitor. At this time, Zenon has already requested Mikhail to send Shen Du and his crew at the appointed time."
  },
  {
    "id": 10113020,
    "text": "Zenon is successful in reuniting with Shen Du and the others. According to Zenon, Dahao has built a hideout under Messina Castle to sneak into the imperial library. Zenon allowed himself to be captured by the Empire as part of a plan to find this hideout."
  },
  {
    "id": 10113030,
    "text": "While exploring the massive underground passageways of Messina, Dowd falls into a pit. Zenon says that he will not leave anyone behind, even if they are Otherworld Warriors, and he jumps in after Dowd."
  },
  {
    "id": 10113040,
    "text": "While searching for Dowd, Jamil gets frustrated by their slow progress and runs ahead, leaving Zenon and the others behind.\n\nThis Jamil has the memory of losing Dowd. He is awash in the pain of losing a friend closer than a brother."
  },
  {
    "id": 10113050,
    "text": "Zenon and the others proceed underground and safely meet with Dowd again, who says he has found some stars in the sewers. At that moment, the group sees a vision of the past.\n\nShen Du is stunned and recognizes it as a Celestial InstaMap, an art developed by Dahao."
  },
  {
    "id": 10113060,
    "text": "The Celestial InstaMap is an art that replays a moment in the past as a vision. It was devised by Dahao, through her research on the towers and visions.\n\nJamil discovers a passageway in the sewers. The group keeps moving, wary of pursuers."
  },
  {
    "id": 10113070,
    "text": "As they follow the passageway, stars once again appear before the group and a vision begins.\n\nIt shows a Shucho mage called Barthelemy leaving the mages of the Volcano sect."
  },
  {
    "id": 10113080,
    "text": "Zenon speculates that perhaps Dahao left these visions behind for them to see.\n\nThe next vision shows Barthelemy running away from pursuers with his lover Melissa, a Genbu mage."
  },
  {
    "id": 10113090,
    "text": "The group fights off more beasts as they continue down the passageway when again, another vision appears.\n\nIn it, they see Barthelemy and Melissa living with two children. Barthelemy sings a nursery rhyme. His pet parrot sings it back. But the family's peaceful life is suddenly interrupted by the appearance of Abyssal demons."
  },
  {
    "id": 10113100,
    "text": "Barthelemy and Melissa attempt to escape while battling the Abyssal demons, but they are defeated by the never-ending waves of demons and Melissa collapses. As Barthelemy expends his last breath, a mask shrouded in an evil aura speaks to him.\n\nHe accepts the mask's conditions in order to save his children, Polka and Liz... and he is reborn."
  },
  {
    "id": 10113110,
    "text": "The party reaches Dahao's hideout just to run into Tu Kwai and Daean soldiers, who have been trying to infiltrate the castle.\n\nZenon orders Shen Du and the others to go back and tell Mikhail everything. He then acts as a decoy, so they may escape."
  },
  {
    "id": 10114001,
    "text": "Mikhail gives Polka and company a mission to rescue Zenon, who is now captive in Dae. They head east to Huang to gather allies.\n\nMeanwhile, Mikhail and the other six heroes who overcame the calamity 300 years ago set out to rescue the eighth star, Sarah."
  },
  {
    "id": 10114010,
    "text": "The team of seven going to Zenon's rescue is Polka, Liz, Valdor, Shen Du, Madeleine, Brownie, and Evelyn.\n\nCurrently, Evelyn has no memory of what happened after she became a witch, but Polka is wary of her nonetheless. He understands that he is not strong enough to protect Liz, but as her older brother, he wants to protect her still."
  },
  {
    "id": 10114020,
    "text": "With the strange power to hear Sarah's voice, Evelyn followed it to find the shrine containing Sarah's memories. Mikhail and his group are now heading to the shrine.\n\nSo much has happened ever since retrieving Liz. Still, they continue to do what they must."
  },
  {
    "id": 10114030,
    "text": "Polka doesn't like how close Liz is getting to Evelyn. Brownie scolds him, saying Evelyn's a different person now than when she was a witch. Polka refuses to believe it.\n\nMeanwhile, Barthelemy has topped a Demon Tower, subjugates Kzinssie of the Seven Heroes yet again, and is now going after Polka's group."
  },
  {
    "id": 10114040,
    "text": "In a cave said to contain the last shrine, Mikhail's group sees a vision of Celestial InstaMap featuring none other than Karman.\n\nValdor says that cave is home to most fearsome demonic beasts. Shen Du speaks as though he knows about the cave for some reason."
  },
  {
    "id": 10114050,
    "text": "In the vision, Karman says that this is a regenerated world, a fabrication. He stands before the altar where the Archfiend's relics are enshrined, attempting to take into himself the Archfiend who vanished 900 years ago. The ritual seems to have failed..."
  },
  {
    "id": 10114060,
    "text": "Polka's group decides to stay the night at an inn in Rashkuta, the capital of the elephant tribe.\n\nKatarina speculates that Karman will likely try to find another vessel for the Archfiend since he failed to become one himself. Realizing that Sarah is his target, they hurry to the shrine to rescue her."
  },
  {
    "id": 10114070,
    "text": "Sarah is talking to someone in a pitch-black space. She asks to be released. The mysterious figure refuses, saying if she leaves, the other will be forgotten. There is another person trapped in that space with her, a young boy.\n\nEvelyn has been listening to Sarah's voice at the inn in Rashkuta. At that moment, outside the inn, elephants within the city are transforming one by one into demonic beasts."
  },
  {
    "id": 10114080,
    "text": "Barthelemy recounts his past while looking at his reflection in the water.\n\nHe says he will awaken Polka's abilities and departs with Kzinssie."
  },
  {
    "id": 10114090,
    "text": "Polka and the others fend off the attacking beasts. An Abyss Gate appears in the sky above Rashkuta.\n\nBefore the group can recover from their shock, Barthelemy appears with Kzinssie. He tells Polka that it's time he learns his fate."
  },
  {
    "id": 10114100,
    "text": "Polka and the others defeat both Kzinssie and Barthelemy. Barthelemy tells Polka he will show him everything and reveals to him memories of his own past.\n\nPolka learns that Barthelemy is his father. He's shocked. Then Barthelemy, with his last breath, tells him to live on with Liz."
  },
  {
    "id": 10114110,
    "text": "Polka sinks into despair, having lost his father. Yet at that moment, the power of Shucho leaves Barthelemy's body and enters Polka's. Then, the shadow of a Sinistral takes form from the Abyss Gate in the sky."
  },
  {
    "id": 10115001,
    "text": "Polka and the others challenge the shadow that emerges from the Abyss Gate, that of Earthlord Alloces.\n\nMikhail's group has safely rescued Sarah and escaped the cave where the shrine is located."
  },
  {
    "id": 10115010,
    "text": "Polka's party is on their last legs in the battle against the fearsome Sinistral. Then, Polka uses the Shucho Arts he inherited from Barthelemy to defeat Alloces.\n\nBarthelemy's corpse turns to ashes, leaving only his journal behind."
  },
  {
    "id": 10115020,
    "text": "Despite having suddenly lost his father, Polka is certain he can feel his parents watching over him. The party makes haste to Huang to complete their mission.\n\nWhile Mikhail and his team are resting at the foot of a mountain, a group of elephants with a lot of luggage passes by."
  },
  {
    "id": 10115030,
    "text": "Polka and Liz read Barthelemy's journal and learn that since their days in the circus, their father had always protected them.\n\nThe elephants say that they have fled Rashkuta, being chased out by the demonic beasts and their unending assault."
  },
  {
    "id": 10115040,
    "text": "Bai Meiniang of Huang recounts that the country of Dae bears a striking resemblance to the legend of an ancient kingdom. As Dae's capital is protected by a powerful barrier, they must first destroy it with the help of Undine's and Volcano's mages."
  },
  {
    "id": 10115050,
    "text": "The plan is that after breaking the barrier, the mages will cause a commotion in the capital. Polka's group will use this diversion as a chance to rescue Zenon. They start the operation, trusting the limited intel Loanne's spies have gathered.\n\nAround this time, Sarah, who has been resting in the woods, regains consciousness. However, she's burning with a fever. Then, Julian finds a doctor's sign in the woods."
  },
  {
    "id": 10115060,
    "text": "Valdor points out a dry well near the palace as the route they will use to infiltrate it. According to spy intel, within the well, there is a passageway that leads to the palace."
  },
  {
    "id": 10115070,
    "text": "Polka's party makes for the palace as one to break Zenon out before the enemy detects them.\n\nHowever, Tu Kwai sees through the disturbance in the capital as a diversion and orders the imperial guards to mass troops at the secret passage's exit."
  },
  {
    "id": 10115080,
    "text": "Mikhail and his group bring Sarah, who is terribly feverish, to the clinic in the forest. According to Dr. Nusakan, her symptoms are caused by a curse."
  },
  {
    "id": 10115090,
    "text": "Polka's party gets through the passage and out into the palace gardens, but Tu Kwai has long been waiting. Madeleine strikes first and takes down Tu Kwai, who turns into a clump of mud. The other soldiers also turn to mud, and they all combine into one body. The large mass of mud takes on a humanoid shape and attacks the party."
  },
  {
    "id": 10115100,
    "text": "According to Nusakan, there is something yet needed to break Sarah's curse and recover her memories. At that moment, a pink elephant stumbles in, asking for help. The pink elephant, having met Sarah, regains the memory of picking up a baby boy in the Rotten Sea Ruins. Then, in a final show of resistance, the curse becomes a demon and attacks the party."
  },
  {
    "id": 10115110,
    "text": "Polka's group is having trouble fighting Dae's Colossus as their attacks don't work. Then, Shen Du begins speaking in a woman's voice. When he steps out from the shadows, Shen Du has turned into a woman. She introduces herself as Ren Dahao.\n\nMeanwhile, Mikhail's party has defeated the curse demon, and with the curse undone, Sarah awakes."
  },
  {
    "id": 10115120,
    "text": "Polka and the others combine their strengths and take on Dae's Colossus again. Dahao instructs Polka and Liz to use spells together. They finally defeat the Colossus.\n\nSarah retells how she was trapped in a dark room with another Child of Destiny, the Young Boy. With this, Ellen and the others also regain their memories of the boy."
  },
  {
    "id": 10116001,
    "text": "Fegan and Zenon meet in the Messina Empire.\n\nZenon speaks the truth of the battle between the country of Dae and the Grave Knights and of Ren Dahao's prophecies. However, Fegan does not believe in the return of the calamity.\n\nZenon leaves the meeting and departs for Lance."
  },
  {
    "id": 10116010,
    "text": "After the battle with Dae, Dahao has once again disappeared, leaving Polka and the gang with only a note that tells them to go to Lance. So, Polka's party sets out for Lance.\n\nAlso, Madeleine has gone to the City of Kings by herself."
  },
  {
    "id": 10116020,
    "text": "Many are gathering in Lance, Otherworld Warriors included. Following the guidance of the astronomers, Polka's party arrives at the Matriarch's mausoleum. Dahao's aim is to prepare for the Rise of Morastrum and protect all new life with the help of Otherworld Warriors.\n\nShe has called them here so they can meet some people."
  },
  {
    "id": 10116030,
    "text": "The astronomers Johannes and his sister Anna teach Polka's group about the three Rises of Morastrum that have plagued the world and about the Children of Destiny. According to Dahao's prophecy, Polka and Liz will be deeply connected with the Child of Destiny who will survive the fourth Rise.\n\nZenon joins the party. Together, they prepare to battle Byunei the Sinistral, and make for Mount Louv."
  },
  {
    "id": 10116040,
    "text": "Dahao disguised herself for two reasons: to elude her pursuers, and to measure the worth of Polka and the others, the New Eight Stars in the prophecy.\n\nMeanwhile, Mikhail's group visits the Rotten Sea Ruins with Sarah. Seeing this place, which shouldn't have existed in the regenerated world, Sarah becomes certain that someone she must meet is there."
  },
  {
    "id": 10116050,
    "text": "The world was regenerated by Sarah's wish 300 years ago. Her prayer for a better world included bringing back Gwayne the Dragon on Mount Louv.\n\nIn the meantime, Madeleine ventures into the heart of the City of Kings in search of the Khamsin. She stands in front of a grave when a mysterious voice begins to speak..."
  },
  {
    "id": 10116060,
    "text": "Atop Mount Louv, Zenon and the others beseech Gwayne the Dragon for aid, but the dragon says it has lived for 300 years and is now too old to best Byunei. However, Gwayne tells them of a certain Grave. The Otherworld Warrior held within is a Gwayne from 300 years past."
  },
  {
    "id": 10116070,
    "text": "Madeleine's late brother suddenly appears before her, but he then transforms into a black dragon. She is met with a choice: Does she slay her brother to gain the Khamsin?\n\nMeanwhile, Polka and company arrive at the Grave where Gwayne awaits."
  },
  {
    "id": 10116080,
    "text": "Sarah and the others reach a magic circle that will take them to the space where the Young Boy is trapped. Dahao's prophecies warn that if either Sarah or the Young Boy, the Children of Destiny from 300 years ago, were to vanish, the regenerated world would cease to exist. Sarah and the others jump into the magic circle to save the Young Boy."
  },
  {
    "id": 10116090,
    "text": "Polka's party sees the final vision, a scene showing Gwayne the Dragon, moments before being slain by Monika's party. This means they are close to the top of the tower.\n\nAt the same time, Madeleine has slain her brother, who turned into a dragon. The Khamsin appears before her, as real and palpable as the grief of losing her brother again."
  },
  {
    "id": 10116100,
    "text": "Polka's party reaches the top of the tower and opens the Doors of Light. \n\nSarah and the others meet the Young Boy in the dark space. However, he says that it is a trap set by the Archfiend to lure them to that place. With the Young Boy, Sarah, and the rest of the Eight Stars from 300 years ago cut off from the world, the Rise of Morastrum threatens to repeat."
  },
  {
    "id": 10116110,
    "text": "The Dark Star blots out the sun, enveloping the world in darkness. In an empty pub, the Minstrel writes of the future into a book and sings a ballad of battles past...\n\nPolka's gang frees Gwayne and hops on its back to go face Dragonlord Byunei."
  },
  {
    "id": 10117001,
    "text": "Hector and some Otherworld Warriors, led by Grave Knight Flurry, make their way to the Grave of Dorra the Dragon.\n\nPolka and his group are heading toward Mount Taftan atop Gwayne when they are attacked by demonic beasts who serve Byunei."
  },
  {
    "id": 10117010,
    "text": "Polka's party fights back the beasts while on Gwayne's back, but the enemy's relentless assault forces them into a difficult position.\n\nSarah and the others are trapped in the dark space, but the Young Boy says there should be an exit somewhere. He and Sarah work together to try and find it."
  },
  {
    "id": 10117020,
    "text": "Polka and company escape the beasts' onslaught and retreat into a cave. One reason they are so hard-pressed is that Gwayne, perhaps assessing their prowess, does not help them.\n\nIn the pub, the Minstrel sings of Polka's battle."
  },
  {
    "id": 10117030,
    "text": "Sarah's group cuts a path through the dark space while mowing down the demons of the Abyss.\n\nPolka's party finds themselves in a tight spot, surrounded by Byunei's beasts. Madeleine, holding the Khamsin in hand, comes to their rescue."
  },
  {
    "id": 10117040,
    "text": "Sarah and the others have escaped from the dark space and returned to the regenerated world. However, the Rise of Morastrum is already shrouding the world in darkness.\n\nPolka's party arrives at the Abyss Gate on Mount Taftan. As they try to close it, Dragonlord Byunei's shadow form appears before them."
  },
  {
    "id": 10117050,
    "text": "Polka and crew take to the skies with Gwayne once again to face off against Byunei. Yet Byunei has become even stronger in these 300 years, and even Gwayne is struggling. Help then comes in the form of Gwayne's mother, the Great Dragon Dorra, carrying Sif and the others."
  },
  {
    "id": 10117060,
    "text": "With Gwayne and Dorra's support, Polka and the others are able to drive Byunei away. However, Liz has been gravely wounded and collapses. Suddenly, a sinister miasma wraps around her. It takes on the shape of the Archfiend, goes inside her body... and vanished.\n\nFollowing this... Liz is found pregnant."
  },
  {
    "id": 10201001,
    "text": "In rescuing the Young Boy, Sarah's group spares the world a calamity. Thus, the Children of Destiny from 300 years ago are freed from their fates.\n\nAfter the battle between Polka's party and Byunei, Liz somehow becomes pregnant and gives birth to twins. However, one of the twins has disappeared...\n\nIn the meantime, Zenon is once more captured by the Empire while Dahao and Shen Du make plans to flee."
  },
  {
    "id": 10201002,
    "text": "During their travels, Polka and company stop by a desolate town. When Tatyana meets up with them after visiting a shop, bounty hunters appear from the shadows. They are now hunted as accomplices of Zenon, former Marquis of Loanne.\n\nValdor is working as an Endangered Species Protection Officer with Faerie as his assistant when Evelyn's servant spirit comes to them."
  },
  {
    "id": 10201010,
    "text": "Polka's party defeats the bounty hunters and makes for Naj, where Madeleine is.\n\nSome days prior, Evelyn stands before a sky covered in an ominous aura. She feels the Archfiend's return to the world once again. She and the Minstrel speculate that he's going after a girl called Jo."
  },
  {
    "id": 10201020,
    "text": "Over the course of 15 years, Madeleine has led the people of Gessiah to rebuild the Kingdom of Naj. Polka and company are in the palace, resting from their travels when they receive word from Evelyn and depart for the Solitary Island on the Silent Sea, the place where Zenon is banished.\n\nMeanwhile, Undine and Volcano, who are tasked with Jo's tutelage, are going after her as she has gone to a lake."
  },
  {
    "id": 10201030,
    "text": "Evelyn sends servant spirits to warn Polka and the rest of the New Eight Stars of the crisis. \n\nAlthough the Dark Star brought about the Rise of Morastrum 15 years ago, the deadly calamity never came. So, Dahao, who prophesied it, as well as those who believed her and deceived the populace, such as Zenon and the New Eight Stars like Polka, became fugitives. Polka and Liz, with Tatyana posing as Liz's daughter, have acted as decoys to hide Jo, who is branded as an outcast."
  },
  {
    "id": 10201040,
    "text": "Undine and Volcano go to the lake looking for Jo, but she is nowhere to be found. They figure she has gone to the bottom of the lake where the Genryu lives, so they go in after her.\n\nIn the meantime, Zenon, who has been living on the Silent Sea's Solitary Island, sees a ship approaching the island."
  },
  {
    "id": 10201050,
    "text": "After 15 years, Polka and the others reunite with Zenon. Polka says that time changes all things, but Zenon replies that not everything changes.\n\nJo confronts Genryu, the dragon who lives at the lake bottom. She says she means to make it her pet."
  },
  {
    "id": 10201060,
    "text": "Zenon leads Polka and the others to none other than Vanguard and the Otherworld Warriors. Together, they hurry over to Jo.\n\nWhile chasing Jo, Undine and Volcano are on their last legs fending off demonic beasts strengthened by the miasma. They are saved by Jo and Genryu, whom she has subdued. She fights the beasts making use of hybrid spells."
  },
  {
    "id": 10202001,
    "text": "Polka's party is overjoyed to see the Otherworld Warriors again. Liz seems intent on giving Jo the skills to fight against the impending disaster, but the warriors are concerned for Jo's emotional state, as she is still young.\n\nMikhail and Zenon make arrangements to collect Jo."
  },
  {
    "id": 10202010,
    "text": "Dahao seems to believe the man behind it all is Karman, who has been trying to reawaken the Archfiend. She and Shen Du course the world in pursuit of him. Polka doesn't yet know Karman's goal, but he is determined to fight to protect Jo.\n\nUpon learning that her mother is coming for her, Jo exclaims she doesn't wish to see her and runs away."
  },
  {
    "id": 10202020,
    "text": "Julian and company discuss about Madeleine. She now wields the Khamsin, the same blade as the hero Khalid, and has grown even more dependable in these 15 years. Valdor and Brownie are battling some demonic beasts when Evelyn joins up with them. One after another, the New Eight Stars are coming together.\n\nIn the meantime, Jo, who has run away from home, visits Eule. Eule tells her to live her life as she wishes."
  },
  {
    "id": 10202030,
    "text": "Polka and company run into a cave to get away from the black mist that kills all it touches. Zenon seems to know something about the one controlling the mist..."
  },
  {
    "id": 10202040,
    "text": "Brownie and the others see Polka's group being tailed by the black mist on the other side of the river. As they run, Liz twists her ankle and stumbles. Brownie shakes off the haunting memories of the past and goes to her rescue. With Brownie's help, Liz safely escapes the mist."
  },
  {
    "id": 10202050,
    "text": "Polka's group rendezvous with Madeleine's at the shore of the lake. Then, Genryu rises from the lake and threatens them, but Jo comes and disciplines it.\n\nShe asks Liz why she came to see her. Liz agrees to answer, and together they go to Undine and Volcano."
  },
  {
    "id": 10202060,
    "text": "The one who creates the black mist is another young boy, who's accompanying Karman. He says he finds comfort in the silence that follows when his black mist extinguishes life. Dahao and Shen Du, who have been going after them, also feel that horrifying, evil aura.\n\nAll the while, rumors are spreading in Messina. Rumors that Emperor Fegan has been assassinated and replaced by an impostor..."
  },
  {
    "id": 10203001,
    "text": "Liz and Jo do not have the sentimental reunion one might expect from a mother and daughter. There is still a great wall between them.\n\nAs Dahao and Shen Du are about to return to share what they learned with Zenon, they get trapped in a binding spell. Another Young Boy has become aware of their presence."
  },
  {
    "id": 10203010,
    "text": "Zenon seems to have an idea about the black mist's wielder, a theory he has come up with after 15 years of contemplation. He is waiting for Dahao's corroboration to be sure.\n\nAll the while, the black mist grows ever closer to the Solitary Island in the Silent Sea. Mikhail, who remains in Vanguard, strengthens the island's protections with the astronomers and Otherworld Warriors."
  },
  {
    "id": 10203020,
    "text": "Dahao and Shen Du are held in a dungeon. From her conversation with Shen Du, Dahao seems to have gotten some answers concerning the identity of the one who robbed the world of Sarah's memories and the truth about the Archfiend's return. They start devising a way to escape to relay this information to Zenon before their memories are stolen again."
  },
  {
    "id": 10203030,
    "text": "Jo and the Otherworld Warriors drive back the demonic beasts that attack the pier. The group finds a handy ship and plans to depart for Vanguard. At the same time, Sarah is concerned about the Young Boy who has remained in Vanguard.\n\nMeanwhile in Vanguard, the other young boy is trying to engulf the island--barrier and all--with his black mist."
  },
  {
    "id": 10203040,
    "text": "Polka's party approaches Vanguard on their ship and sees the island getting swallowed up in the black mist. Jo pays no mind to her mother's calls for restraint and leaves for the island on Genryu, saying she follows only her own orders.\n\nIn Vanguard, citizens are turning into termites from a trap set by Karman and begin attacking the barrier casters. Mikhail and the others fight to stop them."
  },
  {
    "id": 10203050,
    "text": "A mysterious door appears before the captive Dahao and Shen Du. It seems to be a door the enemy put there to purposefully let them escape. Dahao says she has something to do before they escape and talks about the ritual of Soul Inheritance handed down through astronomers. She conducts the ritual on Shen Du and has him escape first."
  },
  {
    "id": 10203060,
    "text": "Jo and Genryu alight on Vanguard and defeat the termites. Moments later, the black mist fades.\n\nAt the same time, Dahao is left behind in the dungeon because of the enemy's curse. She entrusts her wish to the New Eight Stars and turns to stone.\n\nKarman harshly critiques Another Young Boy for lifting the black mist unprompted. But he counters by saying he follows only his own orders."
  },
  {
    "id": 10204001,
    "text": "It has been some days since Jo came to Vanguard, and the Otherworld Warriors are still hunting down termites. At that time, Polka's group meets up with the Otherworld Warriors to ask about Jo's whereabouts. They say she followed some termites into the woods but hasn't come back."
  },
  {
    "id": 10204010,
    "text": "Zenon receives word from Julian and Thomas that Sarah has disappeared. Nobody knows where the Young Boy has gone, but being another Child of Destiny, Sarah may be able to see where he is. Zenon tasks Thomas's group with the search for her.\n\nIn the meantime, Jo and Genryu, who have slipped away from the termite cleanup, run into the Otherworld Warriors who are going to search for Sarah."
  },
  {
    "id": 10204020,
    "text": "It is said that Sarah disappeared soon after asking around if anyone had seen the Young Boy. Ellen mentions that perhaps she has made up her mind to look for him. Jo feigns ignorance while going with Thomas's team. They are concerned about Polka and Zenon's permission, but she just tells them not to worry over such details."
  },
  {
    "id": 10204030,
    "text": "Thomas's crew has hit a roadblock in the search when there are no more sightings of Sarah. They are not sure what to do. Even if they split up, it isn't safe. The beasts along the way are too powerful.\n\nMeanwhile in Vanguard, Polka and company are about to go bring back Jo when they hear that Shen Du has returned alone and wounded. They have to wait for him to recover to hear what he has to say."
  },
  {
    "id": 10204040,
    "text": "The Young Boy stands in front of a Grave. He hears a voice telling him to open the door if he wishes to know himself, so he does and goes inside.\n\nKarman questions the other young boy, who is the source of the voice. Karman says he knows what the Archfiend desires, but the other young boy calls the Archfiend and the Matriarch observers."
  },
  {
    "id": 10204050,
    "text": "Ellen and the others catch up with Sarah, who is standing in front of a Grave. She says she knows the Young Boy's in there and that she's going to find him. They decide to save him so that he won't be trapped in loneliness. Jo becomes excited as she senses a powerful foe lying in wait.\n\nAround that time, the Young Boy reaches the top of the tower."
  },
  {
    "id": 10204060,
    "text": "Having reached the tower's summit, the Young Boy witnesses a vision of Sarah coming to his aid while he is trapped in the Abyss. However, he hears a voice suggesting what he is seeing is no more than his wish. Following the voice's lead, he peers into the void of his heart. He sees himself in the depths of the Abyss, dying alone, and the allure of death takes over his heart."
  },
  {
    "id": 10204070,
    "text": "Jo defeats the demonic beasts in the tower with a fire compound spell. Myriam asks her if she can use spells mixing fire and water. Jo answers with confidence that she could do it with some practice. Myriam tells her that it's impossible because fire and water are opposing elements. If she somehow managed to do it, it would upend the natural order of things. No one knows what might happen. She warns Jo of how dangerous her power could be."
  },
  {
    "id": 10204080,
    "text": "Shen Du regains consciousness and tells Zenon about Dahao's memories that reside within him.\n\nPolka's group reaches the tower Jo and the others have entered but Mateo, a Grave Knight from the Marquisate, stops them. He says something isn't right with the tower.\n\nMeanwhile, the Young Boy follows the voice and opens the Doors of Light. Beyond the doors, he comes face to face with Another Young Boy."
  },
  {
    "id": 10205001,
    "text": "Polka uses the Shucho spell Revive. He gets the feeling it may one day come in handy.\n\nJo and the Maiden of Lance--the Matriarch--are having fun in the control room of the submarine heading to the World Tower. They accidentally press a button and the others scold them. Moments like these play out as they make their way. Their destination lay before them: the giant Grave known as the World Tower."
  },
  {
    "id": 10205010,
    "text": "Jo can barely contain her excitement at the idea of facing mighty foes in the World Tower. Liz chides her recklessness but Jo storms off rebelliously. She is still conflicted about her mother.\n\nSarah has a dream of the Young Boy's past. He is pushing others away and telling her to leave him alone. This only serves to renew her conviction that he must not be left alone."
  },
  {
    "id": 10205020,
    "text": "Another Young Boy tells the Young Boy he will give him a pet. A corrupted holy beast comes forth from the sea. The beast, once known as the Sage of the Isle of Beginnings, is now cloaked in an evil aura.\n\nIn the meantime, Karman uses a spell that robs memories. Darkness eats away at the Young Boy's memories of ever meeting Sarah until only recollections of loneliness remain."
  },
  {
    "id": 10205030,
    "text": "Shen Du speaks the truths Dahao entrusted him: Karman has the power to take away memories, and a young boy is by his side. Upon learning that this young boy is the powerful mage that controls the black mist, Zenon and company resolve to protect Vanguard.\n\nMeanwhile, demonic beasts have blocked the entrance to the World Tower. Jo steps out to defeat them despite receiving no such orders. Polka and the others hurry after her."
  },
  {
    "id": 10205040,
    "text": "Polka starts to drown while chasing Jo. Liz leaves his rescue to the others while she continues after her daughter. Jo and Genryu are fighting a fierce battle against the fearsome beasts that appear. Just as they are about to attack Jo, Liz sacrifices herself to save her.\n\nAt that time, Another Young Boy speaks to the Young Boy, who now remembers nothing but despair. He tells him he should say goodbye to Sarah and the others."
  },
  {
    "id": 10205050,
    "text": "After suffering an attack from demonic beasts, Liz has stopped breathing. Jo apologizes to her mother, who gave it all to protect her, and calls her \"Momma\" for the first time. At that moment, the Revive spell Polka used on Liz is activated. Liz is freed from death's grip. Before they even have a chance to rejoice, however, Liz senses a gigantic creature approaching."
  },
  {
    "id": 10205060,
    "text": "The Corrupted Beast approaches the submarine, and the Young Boy is riding it. Jo asks Liz to teach her how to use her powers if they survive the battle.\n\nMeanwhile, Vanguard is surrounded by the Empire's imperial fleet. Mikhail and Zenon seem to have a plan of sorts.\n\nMaximus, along with a mysterious robed figure, can be seen on the deck of one of the ships."
  },
  {
    "id": 10206001,
    "text": "The Corrupted Beast stirs a potent current, blocking the path to the World Tower. Around this time, demonic beasts continue to attack Vanguard. Mikhail takes it upon himself to buy time for Zenon's plan as preparations continue.\n\nMeanwhile, the figures on the imperial ship's deck are Maximus and Ludwig, both from 300 years past."
  },
  {
    "id": 10206010,
    "text": "The submarine is heading home to Vanguard after shaking off the beasts in pursuit. They have much to discuss upon their return, such as measures against the Corrupted Beast and the Young Boy. In the midst of all this, Jo, who has just been scolded for being too rash, starts fighting a squid monster."
  },
  {
    "id": 10206020,
    "text": "Liz advises Jo to only defend against any enemy they encounter on their way back to Vanguard. She says it will serve as training to teach her about her weakness.\n\nIn the meantime, Another Young Boy has led the Young Boy to a cave in which they can see stars. Another Young Boy talks about visions and stretches out his hand. The Young Boy takes it, and their minds travel elsewhere."
  },
  {
    "id": 10206030,
    "text": "Jo is focusing on defense as Liz instructed, but she is clearly not happy about it. At the same time, new squid monsters attack the submarine, so the Silver Emperor and Selma go to take care of them.\n\nThe young boys have entered a vision. The Young Boy remembers his lonely past and to him, Another Young Boy says that if the world rejects you, you may as well destroy the world."
  },
  {
    "id": 10206040,
    "text": "After the attack by squid monsters, Jo's group disembarks near the Ache Woods. They set to return to Vanguard by land.\n\nMeanwhile, Khalid and the others defeat the beasts encroaching upon Vanguard, then deliberately collapse on the spot. According to Katarina, this is part of Zenon's plan. It is an act to draw the imperial forces closer."
  },
  {
    "id": 10206050,
    "text": "Zenon's plan is to appear to be retreating to lure the imperial forces and attack them. It is a plan he devised to compensate for Vanguard's weaknesses. During that time, Shen Du is feeling uneasy. He cannot use Dahao's spells or skills even though he should've inherited her powers. He wonders if it will take some time for him to get used to her powers."
  },
  {
    "id": 10206060,
    "text": "When the young boys return from the vision, they find Igomahl the harlequin. She's an acquaintance of Another Young Boy and she can draw the InstaMap to produce visions.\n\nAs they traverse the jungle, Polka's party witnesses the moment a mysterious figure creates a Grave. The figure flies away, but Jo hops on Genryu and takes off after it."
  },
  {
    "id": 10206070,
    "text": "Over in Vanguard, Zenon's plan has gone off without a hitch, and the Otherworld Warriors are driving back the imperial soldiers one after another.\n\nJo follows the figure up into the sky and asks who they are. The figure flies off without a word, and Jo can neither move nor attack. She decides she must become stronger."
  },
  {
    "id": 10206080,
    "text": "Maximus and Ludwig disembark on Vanguard and confront Katarina's group. Ludwig reveals that he is the current Emperor of Messina and demands them to hand over Jo.\n\nAll the while, Polka's party is nearing Vanguard in boats, surveying the imperial fleet as they go. Liz gives Jo an important lesson and sends her flying away on Genryu."
  },
  {
    "id": 10206090,
    "text": "While Katarina's and Ludwig's forces are battling, Jo and Genryu destroy the imperial fleet from above. Ludwig and his men admit defeat and retreat.\n\nAnother Young Boy asks the Young Boy why he had to bear the fate of the Child of Destiny and invites him to look for the answer. Beside him stands a white Genryu."
  },
  {
    "id": 10207001,
    "text": "Liz gives Jo a small box for finishing her special training, and tells her to open it upon reaching Vanguard. During her training, demonic beasts around the world have grown even stronger. They make for Vanguard together.\n\nMeanwhile, Another Young Boy's group visits a place razed by the Archfiend and abandoned by the Matriarch 900 years prior."
  },
  {
    "id": 10207010,
    "text": "Karman has been following Igomahl's orders. He is frustrated by his role as the one to raise Another Young Boy to become the Archfiend. Igomahl then feeds him the possibility of becoming the next Archfiend himself.\n\nAlong the way to Vanguard, Jo unveils her special move. It is none other than... a plain and simple headbutt. Liz thinks something simple seems the best fit for her."
  },
  {
    "id": 10207020,
    "text": "Jo and Genryu depart for Vanguard from the pier. Liz acknowledges how much Jo has grown since meeting the one who creates towers and realizing her own weakness.\n\nAtop a tower, Sarah ponders the Young Boy's heart. The Matriarch warns her against sharing his thoughts too much. She believes there is a way to save him, but it awaits at the top of the World Tower. It surely holds what will become a ray of hope."
  },
  {
    "id": 10207030,
    "text": "Genbu mage Vassault is leading a group of mages to quell the currents blocking the way to the World Tower. Mikhail's party is formulating a plan to counter the Empire's attack next time.\n\nNot a moment after Jo makes it back to Vanguard, a man calls for help for a boy who has been washed up on shore. As Vanguard residents scramble to call for help, a sinister aura comes out of the boy and envelops the man."
  },
  {
    "id": 10207040,
    "text": "The evil aura eats away at the man. He turns to corrupted ashes and fades away. The Matriarch seems to believe this to be the Archfiend's doing.\n\nShen Du asks Leon about Dahao and feels unease regarding what she said of Inheritance Magic.\n\nJo opens the box Liz gave her to find some unusual clothing and a book. Just then, some Otherworld Warriors walk in, but they are acting strange."
  },
  {
    "id": 10207050,
    "text": "The Matriarch and the others come to Valdor, who has been watching over a lost child. But then an evil aura surrounds the boy and from him, Karman appears. He declares he will become the true Archfiend.\n\nAt the same time, Jo has cornered the Otherworld Warriors when suddenly the Robins come and stop her. It seems they had the warriors attack her as a trial to see if she is worthy of donning the costume."
  },
  {
    "id": 10207060,
    "text": "After a tough battle, Jo's group defeats Karman.\n\nKarman was only chosen by Igomahl to take on the Archfiend's curse when he made contact with him in between dimensions. His defeat has now fulfilled the curse. The Cursed One appears in the sky above Vanguard.\n\nAs Igomahl has foretold, it is the harbinger of the end."
  },
  {
    "id": 10208001,
    "text": "The Otherworld Warriors and mages launch a series of attacks at the Cursed One floating above Vanguard. However, as described in Dahao's book of prophecies, attacking it only makes it stronger. According to Ferdinand, to weaken the Cursed One, they must retrieve someone who has mastered the sun arts from the World Tower."
  },
  {
    "id": 10208010,
    "text": "The Otherworld Warrior kept in the World Tower is said to be the Matriarch. Paulus says that it is her voice the warriors hear when they are freed from the towers.\n\nIgomahl can see what is happening in Vanguard through the eyes of the soul she is connected to. Just then, a Daean mage named Euneo appears, claiming to be her disciple when she was still sane. He challenges her to battle."
  },
  {
    "id": 10208020,
    "text": "Vassault has calmed the massive whirlpool barring the way to the World Tower. Jo asked the Matriarch--at this point still the Maiden of Lance--if she is scared of seeing her future. She replies that she wants to know the meaning to being a Child of Destiny."
  },
  {
    "id": 10208030,
    "text": "A vision of the Matriarch's encounter with Paulus appears before the group. The Maiden of Lance has been captured by Alloces's forces. A lieutenant tries to get his hands on the captive, and Paulus kills him. As a result, the girl is saved. He realizes the girl is the Child of Destiny, the one bearing the destiny of death. He lets her go, hoping to use her destiny as a means of moving up in the world."
  },
  {
    "id": 10208040,
    "text": "While Jo's party is watching the Matriarch and Paulus's past in the World Tower, Igomahl defeats Euneo's group. He says he has sent Shen Du a letter revealing her true identity and evil deeds. However, Igomahl says that even the Eight Stars uncovering that truth is part of her prophecy."
  },
  {
    "id": 10208050,
    "text": "The Maiden of Lance is adrift in a boat when Thorpe spots her from Fullbright & Co.'s ship and saves her. As she talks with Fullbright XII, she gets the idea of using her destiny to fulfill people's wishes. Thorpe and his crewmates wish for an end to the Sinistrals. Since the Archfiend, a Child of Destiny, unleashed the Sinistrals, she, another such child, would banish them back into the Abyss. This would be why she was born a Child of Destiny."
  },
  {
    "id": 10208060,
    "text": "Evelyn has had a bad feeling about the unease Shen Du spoke of and has been looking into the Soul Inheritance ritual. In fact, it is an evil spell called Soul Connection that allows the user to see through the subject's eyes through an exchange of memories. She speaks to Dahao through Shen Du's eyes, as he has been the subject of the ritual. But it is Igomahl who is seeing it all reflected on the surface of a lake."
  },
  {
    "id": 10209001,
    "text": "The Maiden of Lance and her party ask Vassault for help attacking the Fire Fortress, but he refuses. They begin their assault, but destiny alone does not pave the way to success. They wind up losing men as they battle demonic beasts.\n\nEvelyn can't shake the thought that she's missing something even though she has uncovered the truth of the Soul Inheritance ritual. It is then that they receive Euneo's final letter."
  },
  {
    "id": 10209010,
    "text": "In Vanguard, the battle between Igomahl's beasts and the Otherworld Warriors rages on. Exhausted from the fight and the effects of the black mist, Brownie is about to give up, when Mikhail uses sun arts and dispels the despair. They keep fighting, believing in Jo and the Matriarch's return.\n\nThe Matriarch says she doesn't have any special powers. This is exactly why she wants to climb the World Tower and see how she becomes the Matriarch."
  },
  {
    "id": 10209020,
    "text": "It is at a beach, following the defeat at the Fire Fortress, that the Matriarch comes to be. The Matriarch is lamenting her failure, but Vassault tells her that they need to gather the wishes of more people for the power of the Child of Destiny to manifest. They must gather the might of people around the world under the banner of fighting the Sinistrals. And so the Matriarch is born, the one who would end the nightmare the Archfiend started."
  },
  {
    "id": 10209030,
    "text": "Demonic beasts stand in the way of Jo's group as they climb the World Tower. Polka and Liz act as decoys so Jo and the Matriarch can fulfill their mission of reaching the summit.\n\nBack in Vanguard, Shen Du reads Euneo's letter. He's indignant at the letter calling Dahao a monster, but Evelyn tells him that is due to the memories he lost during the Soul Connection ritual. She wants to know who Dahao truly is, as mentioned in the letter."
  },
  {
    "id": 10209040,
    "text": "Polka and Liz take on the demonic beasts. They still trust each other as they did in the circus. They join hands and attempt a combo spell.\n\nThe Matriarch tells Jo that she, like herself, can turn people's wishes into her strength. And that besides Polka, Liz, and those around her, many more will entrust their wishes to her."
  },
  {
    "id": 10209050,
    "text": "The Maiden of Lance returns to her hometown, calling herself the Matriarch and seeking people from all over the world who wish to vanquish the Sinistrals. The news reaches many--Ferdinand, Hilda, Leonid, Paulus--eliciting a spectrum of reactions.\n\nPolka and Liz use the combo spell and successfully defeat the demonic beasts. However, the recoil is severe, and they black out."
  },
  {
    "id": 10209060,
    "text": "The Maiden of Lance opens the doors at the top and meets with the Matriarch outside the world. Her future self shows her destiny, and the Maiden of Lance returns to the tower as the Matriarch.\n\nDahao has once summoned an Abyssal being. She used its power and revived Barthelemy to fulfill her prophecies. The Abyssal being calls herself Igomahl and demands to be entertained."
  },
  {
    "id": 10209070,
    "text": "The Matriarch returns to Vanguard and restores the warriors' hopes by using sun arts. Then, working together with the mages, she finally destroys the Cursed One, who was once Karman. At that moment, Polka and Liz regain the memories Karman had stolen. Memories of Jo's little twin brother, Bertrand.\n\nAround this time, the young boys are trying to awaken the Cursed Ones that lay dormant in the Wastelands."
  },
  {
    "id": 10210001,
    "text": "The Eight Stars now know that Dahao is the enemy. Mikhail suspects she seeks to fulfill her prophecies and become a prophet supreme. Having regained memories of her son, Bertrand, Liz goes off to Karman's lair to meet him.\n\nMeanwhile, Evelyn is at Leonid's castle to try and recover her lost memories as a witch."
  },
  {
    "id": 10210010,
    "text": "Jo and company are looking for a ship at a port town to go search for Bertrand. Jo says that since she was a baby when he was taken away, it hasn't sunk in that she has a brother.\n\nMeanwhile in Vanguard, Zenon and Mikhail proceed with plans to move Vanguard to protect it from the threat of the Empire."
  },
  {
    "id": 10210020,
    "text": "Another Young Boy, or Bertrand, senses that Polka and Liz have gotten back their memories of him. He says that perhaps the Children of Destiny are connected somehow, like how Sarah can hear the Young Boy's voice.\n\nIn the night, Jo catches Polka trying on some unusual clothing. He tries to cover it up. But later, he mutters that he deserves to wear the costume as well..."
  },
  {
    "id": 10210030,
    "text": "The Matriarch tells Sarah that she reminded the Young Boy of his desire to live. However, with his memory stolen, he is overtaken by loneliness and despair once more. They attempt to save him by combining their powers and reaching his heart once again.\n\nLiz asks Jo to join her when \"they\" show up. She says one of them was her teacher and that they took care of her."
  },
  {
    "id": 10210040,
    "text": "Evelyn remembers her past in Leonid's castle. She recalls that a fake Archfiend and Oriax, a demon of the Abyss who took the form of a harlequin, destroyed the village where she and her daughter lived. The demon is a master of astrology and a manipulator of memories. Having regained her memories, she leaves the castle. Leonid remarks that she will remember everything in time..."
  },
  {
    "id": 10210050,
    "text": "Bertrand and the Young Boy arrive at the Abyss Gate in the Wastelands. Bertrand sees the Young Boy hesitate when Sarah's voice reaches him and steps into the gate on his own. Sarah leaves Vanguard with the Matriarch to find the Young Boy.\n\nElsewhere, Polka and company are battling demonic beasts when the Robins arrive to aid them. Polka's family all don their costumes and face the beast as one."
  },
  {
    "id": 10210060,
    "text": "Riding upon Dorra, the Matriarch's group joins up with the Robin Family, who have just defeated some beasts.\n\nMeanwhile, Sarah's group rides Gwayne to the Young Boy's side, and right as they arrive, Bertrand returns from the Abyss Gate. He is cloaked in a wicked aura and uses the power of the Abyss to rouse the Cursed Ones from their slumber."
  },
  {
    "id": 10211001,
    "text": "Bertrand and the Cursed Ones he awakened vanish from the Wastelands. He aims to destroy the world to make it right. And he plans to use the power of the Cursed Ones to do it."
  },
  {
    "id": 10211010,
    "text": "Evelyn visits the Kalmya Caverns and recovers her memories of when she was the Wicked Witch of the East. She remembers one of her daughters, who had been looking to perfect the ancient spell of Soul Inheritance to defeat the foe she so hated, the Archfiend. She calls her Dahao.\n\nAround this time, Polka and his group are surrounded by Daean soldiers born from the earth."
  },
  {
    "id": 10211020,
    "text": "Valdor and Boston are escorting the people of Vanguard to its new location. Just then, a Cursed One appears in the sky above them. Valdor goes into battle against it with the Triones Blade in hand. The other Cursed Ones are also drawing near to Vanguard.\n\nAll the while, Tu Kwai, Queen of Dae, appears before Polka's group yet again."
  },
  {
    "id": 10211030,
    "text": "Brownie concludes that Dahao is a villain, but Shen Du still believes in her. Then, a Cursed One appears before them as well. Brownie takes it on, wielding the Faeries' Bow.\n\nTu Kwai battles Jo's party until the Matriarch uses sun arts and breaks her curse. She says the one who cursed her and the other Daeans is Oriax, a demon of the Abyss who has assimilated with Dahao."
  },
  {
    "id": 10211040,
    "text": "Zenon protects Brownie from the Cursed One's attacks. Brownie is having trouble using the bow, but he offers some advice and joins the fray to buy time.\n\nThe underwater Vanguard safely escapes the Cursed One's pursuit. Mikhail and company try to hasten the move so as to receive the people heading to Vanguard's new location."
  },
  {
    "id": 10211050,
    "text": "Jo and the others defeat Tu Kwai, but then Bertrand appears before them riding a white Genryu. He is shrouded in an Abyssal aura. The Matriarch stops Liz from trying to rush to him. However, Jo hops on her Genryu and flies off in pursuit. The Matriarch warns that fighting him while he bears the power of the Abyss is too dangerous..."
  },
  {
    "id": 10211060,
    "text": "An arrow shot from the Faeries' Bow managed to wound the Cursed One. With this opportunity, Brownie and the others are able to lead the townsfolk to safety.\n\nJo and Bertrand square off. Jo says that if they can't get through to each other with words, they should try fists instead. She prepares to fight.\n\nMeanwhile, Dahao appears before Brownie's group."
  },
  {
    "id": 10211070,
    "text": "Zenon and the others are fighting a losing battle against Dahao, who is cloaked in a sinister aura. Suddenly, the real Dahao shows herself and uses the last of her power on a spell to bind Igomahl.\n\nBertrand has defeated Jo using the power he gained from the Abyss. Polka's party arrives and confronts Bertrand to stop him from trying to kill her."
  },
  {
    "id": 10211080,
    "text": "Dahao explains that Soul Inheritance is a new spell she developed. She says she executed it while making it seem fake to outsmart Igomahl, who could see her every move. She tells Shen Du her power and memories will soon be his and declares him Chief Astronomer. And then, she vanishes...\n\nWhen Jo wakes up, she finds Polka and the others collapsed, defeated by Bertrand's power. Seeing those dearest to her wounded, Jo's rage explodes."
  },
  {
    "id": 10212001,
    "text": "Valdor is exhausted from his battle with the Cursed One. He tells a story of a hero of the Lobster Clan, whom he looks up to. And as he goes to fight the Cursed One again, Boston pledges to support him with all his might.\n\nJo and Bertrand unleash a mixed spell on each other and they both collapse. At the same time, the Cursed Ones cease moving as their master falls."
  },
  {
    "id": 10212010,
    "text": "Demons of the Abyss appear by Jo and the others, who lay defeated on the ground. That's when the Matriarch's party reaches them and she uses sun arts to heal everyone. She asks Paulus and Ferdinand to protect her and Jo for a while. She also asks them to take care of the injured, including Polka, Liz, and Bertrand as well...\n\nMeanwhile, Brownie's group meets up with Evelyn, who, upon touching Shen Du, realizes Dahao is gone."
  },
  {
    "id": 10212020,
    "text": "According to Paulus, the Matriarch and Jo need to go to the tower where the Matriarch was held. They are defenseless during this time, so Polka releases his Shucho power to fight and protect them. \n\nDuring this time, Jo and the Matriarch are inside a pure white space. The Matriarch tells Jo to follow the voice of the one who is waiting for her. She says it is someone she knows very well."
  },
  {
    "id": 10212030,
    "text": "Evelyn is wounded during a battle. Instead of living to atone for her sins, she has chosen to give up immortality to regain her true memories and to bring it all to an end.\n\nJo walks the blank void until she meets the future Matriarch. She summons a tower before Jo's eyes and reveals the truth of the Demon and Divine Towers. Finally, she advises her not to fear the darkness."
  },
  {
    "id": 10212040,
    "text": "Dahao, who has left the Wicked Witch of the East's side, goes to the country of Dae to research the true Soul Inheritance. Even then, Igomahl is eating away at her heart, and she expects to completely vanish one day.\n\nDahao's memories, passed down to Shen Du via Soul Inheritance, are slowly coming alive within him. Evelyn asks him to tell her what happened to her daughter, Dahao."
  },
  {
    "id": 10212050,
    "text": "Jo sees a vision within the tower the Matriarch called forth. It shows Bertrand at a young age.\n\nMeanwhile, Igomahl, who has been trapped by the spell Shen Du inherited from Dahao, waits for the right time and breaks the spell. She laughs and says the end is near."
  },
  {
    "id": 10212060,
    "text": "The girl who befriended the young Bertrand loses her life in a fire in the village. From afar, Igomahl, inhabiting Dahao's body, watches as Bertrand falls into despair. She says he has the Archfiend's power within him.\n\nMeanwhile, the townspeople are reaching their limits during evacuation. So, Zenon, resolved to see them live, stands as a wall against the demonic beasts."
  },
  {
    "id": 10212070,
    "text": "Vanguard, which has been on the move, reaches its destination. The enemy has already located them, so Mikhail's group cautiously begins evacuating the residents.\n\nBrownie and company are at the beach, waiting for Vanguard. Shen Du speaks to Brownie of Dahao's prophecy. He says it will come true if they believe they are the New Eight Stars that will save the world..."
  },
  {
    "id": 10212080,
    "text": "Jo opens the doors atop the tower, but there is no Bertrand. The Matriarch then speaks of the ambitions of the evil being of the Abyss and tells Jo the Archfiend's power resides in both her and Bertrand. Jo is stunned. The Matriarch tells her to defeat Bertrand and that only those who know darkness can overcome it.\n\nJo regains consciousness back in her world and goes up against Bertrand to settle things once and for all."
  },
  {
    "id": 10212090,
    "text": "Jo and Bertrand clash in a heated battle. As they fight, he reveals the truth about the Demon Towers. He says after they were born, their consciousness would separate from their bodies and go around creating Demon Towers. He says even Jo has taken countless lives without knowing it. But Jo does not look away from her darkness. She chooses to fight for those who believe in her. Their spells collide, but eventually Jo's proves mightier."
  },
  {
    "id": 10212100,
    "text": "Oriax's servant spirits pay Byunei a visit. Upon learning of Oriax's return, she figures Oriax intends to summon the Sinistrals and otherworld creatures.\n\nLiz uses Genbu Arts to heal Bertrand. Jo calls him her brother, and Liz and Polka accept him as part of the family."
  },
  {
    "id": 10213001,
    "text": "Once awake, Bertrand tries to go and fight Igomahl on his own to make amends for his misdeeds. He gives Jo an account of the mistake he made in the Abyss...\n\nThe Minstrel, gazing at Vanguard as it floats out at sea, reveals his true form and sings as he once did. A ballad of battles past..."
  },
  {
    "id": 10213010,
    "text": "Bertrand says he has released the soul of the fake Archfiend, which was captive in the Abyss. He meant to use its power, but it had become the Oblivion, so he couldn't contain it. And during the fight with Jo, he cut it off. He ends by saying that if the soul were to find a vessel, Igomahl would become impossible to beat. He then mounts the white Genryu and flies off."
  },
  {
    "id": 10213020,
    "text": "Jo and the others take down the demonic beasts that assailed them. She says Bertrand has taken off, but Zenon had already anticipated it and requested the Matriarch's group to keep tabs on him.\n\nNews reaches Vanguard that evil beings are threatening the world, evil god Saruin, and the Seven Heroes among them."
  },
  {
    "id": 10213030,
    "text": "Shen Du shares the information he gained from Dahao's memories. If Igomahl joins forces with the fake Archfiend and perfects her power, she will be able to freely summon demonic beasts from other worlds. She's also chosen the new vessel for the fake Archfiend: Ludwig, Emperor of Messina.\n\nByunei had once captured Oriax and the fake Archfiend, but now if Oriax subdues the revived Archfiend, she will be powerful enough to destroy even her."
  },
  {
    "id": 10213040,
    "text": "Forneus, Lord of the Sea, commands his forces ready to dispatch. Wagnas of the Seven Heroes launches his Floating Castle. Even evil god Saruin begins seeking sacrifices. But the Otherworld Warriors have also gathered to resist them.\n\nThe New Eight Stars depart for the Empire to eliminate Ludwig before Igomahl attains total power."
  },
  {
    "id": 10213050,
    "text": "Bertrand is trying to close the Abyss Gate in the Wastelands to weaken Igomahl. So, along with the Matriarch's party, who have caught up to him, he ventures into the Abyss to take out the demons guarding the gate.\n\nIn the ballad of the Eight Stars once sung by the Minstrel, the New Eight Stars are in fact the source of evil, and the true heroes are two figures known as Igomahl and Polka..."
  },
  {
    "id": 10213060,
    "text": "Bertrand's group has crushed the beasts of the Abyss with ease. Then they realize Igomahl has already obtained her power.\n\nIgomahl is forcing Ludwig to go by the name Polka to fulfill her prophecy. When Polka and the others arrive, their attacks are useless against her. She uses her power to transport them to a pocket dimension. Inside, she creates an endless stream of demonic beasts from visions. It is to be a stage for everlasting battle."
  },
  {
    "id": 10214001,
    "text": "A bubble appears before Polka and the others while they battle demonic beasts. Barthelemy is the subject of the vision inside. Zenon realizes that Igomahl has the power to manipulate those she brings forth from other worlds. Even the Barthelemy they see before them is her pawn. So, the party abandons their hesitation and fights on."
  },
  {
    "id": 10214010,
    "text": "The Silver Emperor and other Otherworld Warriors are hindered by numerous demonic beasts. The Final Emperor and his team of Otherworld Warriors offer reinforcement. Upon defeating all the beasts, Don Scaccini, who has turned against the Empire, offers to help. The group advances on Wagnas's Floating Castle."
  },
  {
    "id": 10214020,
    "text": "Bertrand's party returns from the Abyss Gate. Vassault mentions that Igomahl has likely gone to put the finishing touches to fulfill her prophecies. The Matriarch tells Bertrand it is his turn to save Jo this time. He tries to locate her, relying on their connection as Children of Destiny."
  },
  {
    "id": 10214030,
    "text": "After a fierce battle, Polka's group defeats Barthelemy. Igomahl seems to enjoy toying with their hearts by making them battle their loved ones. Dorte and the other witch's daughters step out of the next vision. At this, Evelyn casts the first spells against them. Her daughters' deaths are an unshakable reality carved deep into her heart. This has fueled her anger at Igomahl."
  },
  {
    "id": 10214040,
    "text": "Bertrand searches for Jo. The battles of the Otherworld Warriors across the world come in and out of view until he finally finds her. She and the others are in a dimension created by Igomahl, the entrance to which is in Messina Castle. He and the Matriarch's party take off.\n\nAfter they leave, the Minstrel appears and begins his wait for their return to sing prayers of battle's end."
  },
  {
    "id": 10214050,
    "text": "Bertrand and the others reach Messina Castle. The Matriarch tells him they need no longer monitor him and sees him off.\n\nMikhail's party is battling Byunei. Just as they are on their last legs, Hilda and Leonid arrive to aid them.\n\nMeanwhile, Polka and the others finally reach the doors leading to Igomahl."
  },
  {
    "id": 10214060,
    "text": "Polka's group is in a fierce battle with demonic beasts when Igomahl appears before them and unleashes a powerful spell. Brownie tries to nullify it, but its power is too great, and they are overwhelmed. Memories of their life flashes before their eyes... and Brownie perishes.\n\nIgomahl mocks Brownie's weakness, and Polka lashes at her in a rage."
  },
  {
    "id": 10214070,
    "text": "Bertrand breaks through into the pocket dimension and makes his way through the visions that stand in his way.\n\nShen Du and Evelyn have stopped Igomahl in her tracks so Polka and the others can attack. Just as she is about to break free, Evelyn risks her life to keep her in place. And thanks to her sacrifice, Igomahl is blown to bits. However, the remains gather together, and she comes back to life in an even more powerful form."
  },
  {
    "id": 10214080,
    "text": "Igomahl becomes even stronger and has Polka's party against the ropes. Zenon charges forward as a decoy to give them a chance to turn the tables. Zenon gets fatally wounded by Igomahl's counterattack, but Polka and the others follow through and manage to crush her again. Zenon entrusts his Everfrost Blade to Madeleine and breathes his last. However, Igomahl once again transforms and is revived. Bertrand joins them, and the battle rages even more fiercely."
  },
  {
    "id": 10214090,
    "text": "In the meantime, the Matriarch's group has viewed visions of the past that the Archfiend erased and the traces he left behind. The truths they saw paint Igomahl as a mere pawn of the Archfiend. His true aim is to cause Jo to lose control and have her awaken as the Oblivion. So, they hurry to try and stop that from happening to her."
  },
  {
    "id": 10214100,
    "text": "At the end of the deathmatch, Igomahl is undone. But Ludwig, who has taken in the fake Archfiend, appears and overpowers them. Polka risks his life to activate a spell, but the fiend strikes him down. He leaves the rest to Liz, who launches an attack of her own, but she, too, is struck by Ludwig's attack and dies. Jo roars in anger and attacks him, ignoring Bertrand's cries."
  },
  {
    "id": 10214110,
    "text": "Despite her efforts, Jo has lost her comrades. As she laments her lack of strength, a miasma envelops her. She seems to be yielding to darkness, but Bertrand and the Genryus protect her until they fall to Ludwig's onslaught. Jo dispels the darkness just in time to see them all perish. She takes Bertrand's last words to heart, realizes her destiny, and takes on the fake Archfiend."
  },
  {
    "id": 10214120,
    "text": "The Matriarch's group is trying to reach Jo, but just as they get to the pocket dimension, the Otherworld Warriors begin to disappear. The path connecting this world to the towers has been closed off, and those who were summoned are sent back to their worlds. When only the Matriarch remains, a figure appears before her. It says Jo will overcome this crisis in a way that defies belief, much like how Sarah regenerated the world 300 years ago."
  },
  {
    "id": 10214130,
    "text": "Jo gathers her energy and uses a spell mixing fire and water.\n\nIgomahl has, at some point, been replaced with a shadow and is standing in front of the Abyss Gate. Polka and the others, who should've fallen, appear before her alive and well. Jo has manipulated space-time by using the spell of opposite elements, so Polka's group escapes their fates. They drive Igomahl back into the Abyss. However, in exchange for victory, Jo has disappeared..."
  },
  {
    "id": 10214140,
    "text": "After the battle, Jo disappeared, but Bertrand feels that she is still alive. The stars also do not indicate her death.\n\nThe Eight Stars go their own ways while Polka and his family travel around the world in search of Jo.\n\nMuch like when he traveled the land searching for his sister... Polka continues his journey, searching for something precious."
  },
  {
    "id": 10301001,
    "text": "The battle between the New Eight Stars, such as Polka Lynn Wood, and Igomahl, a demon of the Abyss... The Child of Destiny averted the calamity which beset the world. But she did so through a forbidden spell that upended the natural order of things and brought distortion to the world.\n\nSince then, 25 years have passed. People are living a peaceful life, but a disturbing shadow once again darkens this world..."
  },
  {
    "id": 10301010,
    "text": "Liam is a young man attending the Marquisate University in Vanguard. Disturbing rumors spread through the city, but for Liam, today is a day like any other. After school, he visits the lady at the fruit stand. She asks him to go to the castle to deliver \"change for Candy.\""
  },
  {
    "id": 10301020,
    "text": "When Liam visits the castle, he meets a man called Darius. Darius says they are investigating the mysterious Doors that have appeared around the world as they look into the unusual Sleeper incidents. He says they are looking for members and at his suggestion, Liam takes their pilot test. BaIC, the support mech conducting the test, announces that Liam passed."
  },
  {
    "id": 10301030,
    "text": "After passing the pilot test, Liam is welcomed into the Survey Group Clavis. They're trying to get to the bottom of the mysteries of the Sleepers and the Doors with the help of Otherworld Warriors. Liam accepts Darius's request to join the investigation. As a gift for passing the test, Annie, one of the warriors, hands him a gun to use for self-defense."
  },
  {
    "id": 10301040,
    "text": "Liam is charged with investigating a Door alongside Candy the monster and Otherworld Warriors Monika, Leslie, and Rouge. They will be traveling into the Door on the Union, an inter-dimensional vessel. Darius will stay behind in Vanguard to look into a new Sleeper incident."
  },
  {
    "id": 10301050,
    "text": "Liam is taught to operate the Union and safely delivers the crew through the Door into another world. They arrive at a forest and follow Candy's nose, which is sensitive to the scent of demonic beasts. A key beast must be defeated to release the Otherworld Warrior within the Door."
  },
  {
    "id": 10301060,
    "text": "As Liam and crew are following Candy through the forest, they suddenly hear a loud crash. They hurry to its source to find a badly damaged car and a red-headed girl whom Candy is playing with. The girl introduces herself as Anya and offers to be their guide."
  }
]